{"inkVersion":19,"root":[[{"->":"ravi_1_intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"ravi_1_intro":[{"#":"knot:ravi_1_intro"},{"#":"ui:narrator"},{"#":"background:bg_ravi_intro.jpg"},{"#":"music:ravi_intro.mp3"},"^Ravi Kannasamy ",{"#":"title"},"\n","ev",1,"/ev",{"VAR=":"chapter_id","re":true},"^Hey there. I’m Ravi. I’m 24. Aviation engineer.","\n","^Well, ASPIRING aviation engineer, anyway. I’m still in uni.","\n","^One more year to go until I join the working world! I want to be able to support my family soon.","\n","^Family has been just Amma (mother), Revati and I for a while.","\n","^As for Appa... Appa (father) is no longer family.","\n","^He used to be in the airline industry. He’s part of the reason I wanted to become an aviation engineer in the first place.","\n","^He used to sneak Revati and I into the hangars on the weekends, just to look at those airplanes he’d be working on.","\n","^Just looking at those planes, and imagining them take off to the skies – it filled my heart with a great sense of wonder.","\n","^And then...one day, it happened.  It was just another regular day.","\n","^Appa left early in the morning... and didn't come back.","\n","^He left us that day. He’s been uncontactable since. We called and called, but he never picked up.","\n","^Sometimes... I think he wanted to be like the airplanes he worked on, free to roam the skies, to go anywhere they pleased. But I might never find out.","\n","^Since then, Amma, Revati and I have had to fend for ourselves.","\n","^It’s not been easy, especially for Amma. She works a 12-hour shift as a sales assistant at the department store.","\n","^Revati is doing her A levels, and she’s done part-time jobs too.","\n","^My dream is to make life easier for them. If I can fulfill mine, I would be helping theirs too.","\n","^But first, I have grades to keep up, an internship to find, and then hopefully, a job! Like a good Indian boy haha.","\n","^So that’s me -- Ravi.","\n","^And this is what it’s like, to be me.","\n","^CHAPTER ","ev",{"VAR?":"chapter_id"},"out","/ev","^ ",{"#":"title"},"\n","^Home Truths ",{"#":"title"},"\n",{"->":"ravi_1_1_narration"},{"#f":1}],"ravi_1_1_narration":[{"#":"knot:ravi_1_1_narration"},{"#":"ui:narrator"},{"#":"background:bg_ravi_home.jpg"},"^After a tiring day at school, I come home to our little apartment in Tampines.","\n",{"->":"ravi_1_1"},{"#f":1}],"ravi_1_1":[[{"#":"knot:ravi_1_1"},{"#":"ui:scene"},{"#":"background:bg_ravi_home.jpg"},{"#":"speaker_left_image:cha_ravi_mum_normal.png"},{"#":"speaker_left_name:Amma"},"^Halooo ma! ",{"#":"speaker_self"},"\n","^Vaada kanna (welcome, darling). Have you eaten? ",{"#":"speaker_left"},"\n","^Yup, I had dinner. I ate with my classmates after class. ",{"#":"speaker_self"},"\n","^Ok. But you should know, you missed a great fish curry. Looks like I’ll have to throw the rest away- ",{"#":"speaker_left"},"\n","^Oh! Maybe I am a little bit hungry after all. Can I have some curry please? ",{"#":"speaker_self"},"\n",{"#":"background:bg_ravi_fishcurry.jpg"},"^Aha! I knew it. I don’t think you’ve ever said no to my fish curry.  ",{"#":"speaker_left"},"\n","^Hmm...I think you’re probably right! ",{"#":"speaker_self"},"\n","^Mmmm... Amma's fish curry... Amma doesn't really talk about her feelings, so she expresses her emotions through her cooking, especially her curries. ",{"#":"inner_monologue"},"\n","^Even the neighbours came for it, sold on the bright heat of masala and turmeric that’d waft through the window grilles (not all our neighbours enjoyed the smell though.) ",{"#":"inner_monologue"},"\n","^The dish spoke celebration, until the day Appa disappeared. That day, we sat around crying as Amma heaped thick curry onto our plates – knowing it was the only comfort we could have, a piece of the past we could bring to life through Amma’s cooking skills. ",{"#":"inner_monologue"},"\n","^She conveyed her love, and sometimes sadness, through it. ",{"#":"inner_monologue"},"\n","^Anyway, go shower, you look so sweaty. Then you can eat. I’ll reheat the curry for you. ",{"#":"speaker_left"},"\n",["ev",{"^->":"ravi_1_1.0.42.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Hmm ok. See you in 10 minutes.",{"->":"$r","var":true},null]}],["ev",{"^->":"ravi_1_1.0.43.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^It's ok ma, let's eat while it's hot! ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ravi_1_1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.42.s"},[{"#n":"$r2"}],"^ ",{"#":"speaker_self"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_home.jpg"},"^A few minutes later, after the fastest cold shower ever...","\n",{"#":"ui:scene"},{"#":"background:bg_ravi_fishcurry.jpg"},{"->":".^.^.g-0"},{"#f":5}],"c-1":["ev",{"^->":"ravi_1_1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.43.s"},[{"#n":"$r2"}],"^  ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^As always, it smells amazing! I feel like I could eat 10 bowls all by myself. Did you do anything different this time? ",{"#":"speaker_self"},"\n","^Ah, so you found my secret ingredient! I put in some garam masala (a spice) that Pushpa Aunty gave to us when we went over last week. Very fragrant! ",{"#":"speaker_left"},"\n","^I think she made it herself. You know how she is. ",{"#":"speaker_left"},"\n","^Oh nice. Last time we visited her, the sambal she made… also power! She could probably run a sambal chain restaurant! I must have dreamt of her sambal so many times… ",{"#":"speaker_self"},"\n",{"#":"background:bg_ravi_home.jpg"},"^... ",{"#":"speaker_left"},"\n","^Ravi, before you start... we need to talk about something.  ",{"#":"speaker_left"},"\n","ev","str","^Take just one bite first","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Stop and listen","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["^ Oh my god, this is so good!   ",{"#":"speaker_self"},"\n","ev",0,"/ev",{"VAR=":"ravi_1_motherempathy","re":true},"^The way it blends with the richness of the coconut milk and the kick of the curry leaves. You can really taste the - ",{"#":"speaker_self"},"\n","^...Ravi? ",{"#":"speaker_left"},"\n","^...Sorry, please continue. ",{"#":"speaker_self"},"\n","^Yikes...I totally lost myself for a sec there. ",{"#":"inner_monologue"},"\n","^So...today at the shop.. ",{"#":"speaker_left"},"\n","^Oh, sorry Amma, could you pass me the vadai (a snack) please? ",{"#":"speaker_self"},"\n","^...Here. But let me finish. ",{"#":"speaker_left"},"\n","^Now I don’t know why I ate that very average mee hoon in uni. I got so hungry waiting for class to get over.  Should have texted you to ask what was for dinner- ",{"#":"speaker_self"},"\n","^Wait! I’m getting distracted by the food again. I really have to stop eating.  ",{"#":"inner_monologue"},"\n","^Oh wait. I remember why I didn’t text you. Today is Wednesday, right? Isn’t today supposed to be a late shift for you?  ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["^ Amma’s looking very quiet. This can’t be good… ",{"#":"inner_monologue"},"\n","ev",1,"/ev",{"VAR=":"ravi_1_motherempathy","re":true},"^Something feels off about all this … she made fish curry and looks sad  ",{"#":"inner_monologue"},"\n","^Sure...what do we have to talk about? ",{"#":"inner_monologue"},"\n","^... ",{"#":"speaker_left"},"\n","^Wait a minute, Amma, weren’t you supposed to be working late today? ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^Yes. ",{"#":"speaker_left"},"\n","^How come you’re back home early? ",{"#":"speaker_self"},"\n","^That’s what I wanted to talk about... ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_mum_worried.png"},"^So, today at the shop...they told me that they had to let me go. ",{"#":"speaker_left"},"\n","^What? ",{"#":"speaker_self"},"\n","^Yeah. The manager told me this morning. ",{"#":"speaker_left"},"\n","^How did this happen? I thought you were doing well. You’ve never missed a day of work. ",{"#":"speaker_self"},"\n","^Well, it didn’t matter. They asked me to hand in my card anyway. ",{"#":"speaker_left"},"\n","^They told me that it was tough for the business to survive lah. ",{"#":"speaker_left"},"\n","^Not enough people coming into the stores these days. And even when people come in, they don’t like us to approach them when they’re shopping. ",{"#":"speaker_left"},"\n","^They’d rather just shop on their own, in quiet. ",{"#":"speaker_left"},"\n","^But still... I thought they would give us some time you know? At least let me finish the month… ",{"#":"speaker_left"},"\n","^Amma looks really sad. I really don’t know what to do to make her feel better, or even what to say...what should I do? ",{"#":"inner_monologue"},"\n","ev","str","^I'm so sorry to hear that Amma","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^How could they do this?!","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["^ Oh ma. I am so sorry. I really am. ",{"#":"speaker_self"},"\n","ev",{"VAR?":"ravi_1_motherempathy"},1,"+",{"VAR=":"ravi_1_motherempathy","re":true},"/ev","^Thank you, Ravi. I know it’s hard for you. It’s hard for me, too. ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-5":["^ This is so sudden. That’s it? After so many years? How could they?! ",{"#":"speaker_self"},"\n","^That’s how it is...I thought they would have let me stay a bit longer.  ",{"#":"speaker_left"},"\n","^I’ve been there for half my life. I’ve been loyal. But all that didn’t help in the end. ",{"#":"speaker_left"},"\n","^It’s just not fair. Amma worked so hard and this is how they reward her?  ",{"#":"inner_monologue"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Anyway...I think I saw this coming. ",{"#":"speaker_left"},"\n","^What do you mean? ",{"#":"speaker_self"},"\n","^Business isn’t booming. There’s no commission, because there’s no sales. Everyone is buying things online nowadays. ",{"#":"speaker_left"},"\n","^You also buy everything online right? There are so many platforms to choose from. Every bus also has some online sale ad - 11.11, 10.10, Mid-Week sale, Mid-year sale. How to compete?  ",{"#":"speaker_left"},"\n","^Hmm...yeah... ",{"#":"speaker_self"},"\n","^So that’s why lah. ",{"#":"speaker_left"},"\n","^What the hell! If the shopping centre is not doing well, they should fire the CEO! Or the manager! Why fire Amma? She’s been so loyal and hardworking. Fire those idiots on top who are responsible. ",{"#":"inner_monologue"},"\n","^It’s not her fault…  Stupid rich businessmen - all they care about is profit and not people! I can see the tears, welling in her eyes. It’s so unfair. ",{"#":"inner_monologue"},"\n","ev","str","^I hope you're ok ma","/str","/ev",{"*":".^.c-6","flg":4},"ev","str","^Have you told Revati?","/str","/ev",{"*":".^.c-7","flg":4},{"c-6":["^ I hope you’re ok ma. ",{"#":"speaker_self"},"\n","ev",{"VAR?":"ravi_1_motherempathy"},1,"+",{"VAR=":"ravi_1_motherempathy","re":true},"/ev","^I’m ok kanna ",{"#":"speaker_left"},"\n","^... ",{"#":"speaker_left"},"\n","^Amma... you’re crying. ",{"#":"speaker_self"},"\n","^What do you want me to do? I can’t go back there and beg for my job back. ",{"#":"speaker_left"},"\n","^It’s just… like I said, I’ve worked there for so long. It’s all I know. ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-7":["^  Have you told Revati? ",{"#":"speaker_self"},"\n","^Yeah, I did. She is in her room. ",{"#":"speaker_left"},"\n","^What did she say? ",{"#":"speaker_self"},"\n","^What else? Same thing. She’s upset. ",{"#":"speaker_left"},"\n","^...  ",{"#":"speaker_left"},"\n","^Why wouldn’t she be?  ",{"#":"speaker_left"},"\n","^Ever since she was in primary school, I’ve been a sales assistant. I really thought I’d be able to work there until Revati finishes uni. ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^I thought that I could stay there, and that everything would be fine. ",{"#":"speaker_left"},"\n","^But that’s no longer true. ",{"#":"speaker_left"},"\n","^But it’s ok. What’s done is done. We will have to move on. And also, more importantly, we will have to move out of here. ",{"#":"speaker_left"},"\n","^Move out? Why? ",{"#":"speaker_self"},"\n","^I didn’t tell you or Revati about this, but...kanna (dear), we are already two months late for rent.  ",{"#":"speaker_left"},"\n","^We’ve been barely paying it off before then. I don’t earn a lot of money, and I don’t have much savings to spare. I barely have enough to pay it off. ",{"#":"speaker_left"},"\n","^This place was too big anyway. And I didn’t want to affect Revati. You know she’s studying hard for her A-Levels.  ",{"#":"speaker_left"},"\n","^And for your uni fees next year...I don’t want to touch that money. I can’t afford to. ",{"#":"speaker_left"},"\n","^Two months late? Why didn’t you tell me or Revati? We could have helped. Even now she isn't telling us how much the rent is.  ",{"#":"inner_monologue"},"\n","^If we knew what she'd been dealing with, we could have worked part-time more, we could have made the move sooner… ",{"#":"inner_monologue"},"\n","^And my uni money? I’m not studying just for myself. I need to earn and save for this family. I thought.. my going to uni was good for the family  ",{"#":"inner_monologue"},"\n","^Are my uni fees are the reason we’re about to be forced out of a home? I’m not a kid anymore. I have the right to know about our finances so I can help. ",{"#":"inner_monologue"},"\n","ev","str","^We'll figure this out together. Let me help.","/str","/ev",{"*":".^.c-8","flg":4},"ev","str","^Why didn't you tell us?","/str","/ev",{"*":".^.c-9","flg":4},{"c-8":["^ Ok, Ravi, deep breaths. Calm down. Amma is emotional right now.  ",{"#":"inner_monologue"},"\n","ev",{"VAR?":"ravi_1_motherempathy"},1,"+",{"VAR=":"ravi_1_motherempathy","re":true},"/ev","^She can’t help it, and you can’t blame her for it. You know she didn’t mean anything bad. ",{"#":"inner_monologue"},"\n","^It’s time to be the man of the house. You have to step up, Ravi. ",{"#":"inner_monologue"},"\n","^Don’t worry about me. We can figure something out. Maybe we don’t have to move. ",{"#":"speaker_self"},"\n","^I don’t have a choice! My job is to worry about you. ",{"#":"speaker_left"},"\n","^And I don’t think we can afford to stay. The landlord has already been very accommodating.  ",{"#":"speaker_left"},"\n","^He’s already waited 2 months for his rent. I don’t think he’ll be willing to wait for one more. We must move out. ",{"#":"speaker_left"},"\n","^But you love this place. ",{"#":"speaker_self"},"\n","^It’s so near to the park, and the neighbours are so friendly...we’ve lived here for so long, Amma.  ",{"#":"speaker_self"},"\n","^...Ever since Appa left. ",{"#":"inner_monologue"},"\n","^Ravi, we have no choice. We have to move on. ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-4"},{"#f":5}],"c-9":["^  I need to let Amma know she cannot keep such things a secret.  ",{"#":"inner_monologue"},"\n","^Because of her need to ‘protect’ us, we’ve ended up in such a bad state. But it’s my fault too... For just coasting along in my ignorance and not bothering to ask. ",{"#":"inner_monologue"},"\n","^Oh. We’re two months late? Why didn’t you tell us? ",{"#":"speaker_self"},"\n","^You know I can’t. I wanted you and Revati to focus on your studies. I couldn’t have you all worrying about me, or finding another job. ",{"#":"speaker_left"},"\n","^And it’s not like we’re completely broke! I still have enough saved for your uni fees- ",{"#":"speaker_left"},"\n","^Amma, you don’t have to do it all on your own, you know. Me and Revati are old enough to help. In fact, I should already be helping out. I’ve been such a blissful idiot. ",{"#":"speaker_self"},"\n","^Ravi, don’t worry about the money. It’s not your responsibility. It’s mine, and it’s solved. ",{"#":"speaker_left"},"\n","^Come on, Amma. I’m not a kid anymore. At least please let me find a way to chip in so we don’t lose our home. I feel so useless just standing by. ",{"#":"speaker_self"},"\n","^...Ravi, it’s not your fault. I want you and Revati to have a bright future. Brighter than mine. ",{"#":"speaker_left"},"\n","^Which means you have to focus on your uni. Once you’re out and you land a good job, of course it’d be my time to relax. ",{"#":"speaker_left"},"\n","^Ughh. Amma’s too stubborn already.  ",{"#":"inner_monologue"},"\n","^Right now, we have no choice. We have to move. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^Ok... I get it. Where are we moving to? How much will it cost?  ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_mum_normal.png"},"^I have some good news. It won’t cost anything. ",{"#":"speaker_left"},"\n","^What do you mean? ",{"#":"speaker_self"},"\n","^We’re moving to Pushpa aunty’s house. She has a spare room, now that Kamala has moved out with her husband. ",{"#":"speaker_left"},"\n","^She also needs help around the house. When I called her to ask for help, she was so excited to let us stay with her. ",{"#":"speaker_left"},"\n","^I think it will be nice to give her some company and help her out ",{"#":"speaker_left"},"\n","^And when she was growing up in Chennai (in India), it was normal for relatives to stay with each other. So she's happy to have us. ",{"#":"speaker_left"},"\n","^... but we're not from India Amma - we're from Singapore! ",{"#":"speaker_self"},"\n","^Kanna, we are still Indian, and families stick together where we are from. On the bright side, you can have all the power sambal you like. I’m sure she won’t mind cooking for everyone again. ",{"#":"speaker_left"},"\n","^I like Pushpa Aunty and Amma and Revati love talking to her. It’s good that it’ll save us some money. ",{"#":"inner_monologue"},"\n","^...but I know I can’t study there - three of us in that small house - it’s going to be very noisy! ",{"#":"inner_monologue"},"\n","^I can’t afford any bad grades if I’m getting my family a better life. And hell, a better life is what I’m trying to achieve for us.   ",{"#":"inner_monologue"},"\n",{"->":"ravi_1_2_narration"},{"#f":5}]}],{"#f":1}],"ravi_1_2_narration":[{"#":"knot:ravi_1_2_narration"},{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^We packed our lives into bags and started moving in to Pushpa Aunty's house.","\n",{"->":"ravi_1_2"},{"#f":1}],"ravi_1_2":[[{"#":"knot:ravi_1_2"},{"#":"ui:scene"},{"#":"background:bg_ravi_pushpa_home.jpg"},{"#":"speaker_left_image:cha_ravi_mum_dress_normal.png"},{"#":"speaker_left_name:Amma"},{"#":"speaker_right_image:cha_ravi_revati_normal.png"},{"#":"speaker_right_name:Revati"},"^We should move the sofa up first, so we have space to arrange it before the rest of the boxes come in. Ravi could you go downstairs with Revati and take it up? ",{"#":"speaker_left"},"\n","^Why can’t the movers bring it up? ",{"#":"speaker_self"},"\n","^Because you know how much they charge for every staircase? $20! And be careful! ",{"#":"speaker_left"},"\n","^Sigh. Ok I’ll be your cheap labour. ",{"#":"speaker_self"},"\n","^My mom still talks to me as if I were a child. Do this. Do that. ",{"#":"inner_monologue"},"\n","^Then doubts if I can manage this, manage that. It’s like she doesn’t trust me enough to do things on my own. ",{"#":"inner_monologue"},"\n",{"#":"speaker_left_image:pixel.png"},"^Oh god, she was right, this IS heavy! ",{"#":"inner_monologu"},"\n","^Revati, can you come down to help? ",{"#":"speaker_self"},"\n","^Wait, I’m unpacking! There’s so much to do. ",{"#":"speaker_right"},"\n","^...I can't move it by myself ",{"#":"speaker_self"},"\n","^...fine. How heavy can half a small sofa be? ",{"#":"speaker_right"},"\n",{"#":"speaker_right_image:cha_ravi_revati_grin.png"},"^(picks up other end) Oh god, Amma was right, this IS heavy! ",{"#":"speaker_right"},"\n","^Clearly, we’re siblings. ",{"#":"inner_monologue"},"\n",{"#":"speaker_right_image:cha_ravi_revati_confused.png"},"^I hate this. ",{"#":"speaker_right"},"\n","^Wow her mood just flipped 180. ",{"#":"inner_monologue"},"\n","^Hate what? ",{"#":"speaker_self"},"\n","^Wasting the whole day moving things into a house that’s not even ours. Amma can spin it all she wants .... ",{"#":"speaker_right"},"\n","^but it sucks lah! I don’t understand how we got such a lousy life. What did we do wrong to deserve all this? ",{"#":"speaker_right"},"\n","^Sigh, truth is I ask myself the same thing. But saying that out loud won't help her deal. Maybe I should be the big brother she needs now. ",{"#":"inner_monologue"},"\n","ev","str","^Look on the bright side","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I have the same frustrations","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Hey, at least we can afford to study. And we’re not working yet. ",{"#":"speaker_self"},"\n","ev",0,"/ev",{"VAR=":"ravi_1_sharefrustrations","re":true},"^We have no home, no Appa, and no frigging dignity. I don’t think still being in school makes up for all that. ",{"#":"speaker_right"},"\n","^Whoa thangachi (little sister), who says we don’t have dignity? ",{"#":"speaker_self"},"\n","^I don’t know how else to say it… it’s just… it’s embarrassing, you know? ",{"#":"speaker_right"},"\n","^Sigh. Even school is hard. My teacher keeps scolding me when I don’t do enough practice exams on my own, but I don’t know how to explain to her that I can’t afford to buy all those ten year series books. ",{"#":"speaker_right"},"\n","^And even if i could, I just don’t have time to do it. It’s not like I’m lazy..",{"#":"speaker_right"},"\n","^Nobody ever said you were lazy. ",{"#":"speaker_self"},"\n","^I think my classmates think I'm too lazy to iron my uniform. And they see my books are all tattered and think I don't take care of my stuff. ",{"#":"speaker_right"},"\n","^I am trying my best. I think I work harder than all of them, just to stay afloat. ",{"#":"speaker_right"},"\n","^What did we do to deserve this terrible life?!  ",{"#":"speaker_right"},"\n","^Sometimes the world is just like that. You didn’t do anything wrong. Amma didn’t either. We can’t control what happens to us, but at least we can control how we deal with it. ",{"#":"speaker_self"},"\n","^Sigh. Maybe I need to take another job to help pay bills. ",{"#":"speaker_right"},"\n","^No! I will take care of all that for you. You focus on studies. ",{"#":"speaker_self"},"\n","^I wonder what life would have been like if Appa had stayed and Amma didn't lose her job. I could have done so many things with my life. ",{"#":"speaker_right"},"\n","^There’s no point wishing life was different. But this is our life, and we have to make the best of it. It may be harder than other peoples’ lives, but at least we are healthy, and we have each other. Ok? ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^ I wish Amma hadn’t kept the rent issue to herself. We definitely could have worked something out. ",{"#":"speaker_self"},"\n","ev",1,"/ev",{"VAR=":"ravi_1_sharefrustrations","re":true},"^I’m angry about that, too. Like I know she’s trying to protect us and all but look where it landed us! ",{"#":"speaker_right"},"\n","^Now it’s about starting up from the bottom. ",{"#":"speaker_self"},"\n","^I’m just so tired of struggling. First Appa, then losing our place, and now we’re squashed in with Pushpa Aunty. ",{"#":"speaker_right"},"\n","^It’s like we’re always discarded goods. Or we’re the leftovers. ",{"#":"speaker_right"},"\n","^Look Revati, we’ve had our fair share of challenges, but we’re not leftovers. Why’re you always comparing us to food, anyways? ",{"#":"speaker_self"},"\n","^I’m not joking, Anna. Where’s our dignity, man! ",{"#":"speaker_right"},"\n","^My classmates think I'm too lazy to iron my uniform. And they see my books are all tattered and think I don't take care of my stuff. ",{"#":"speaker_right"},"\n","^Sometimes I just want to scream at them and say that this is my only set of uniform, I don't have an iron that works, and my books are all second hand! I AM trying my best. ",{"#":"speaker_right"},"\n","^I think I work harder than all of them, just to stay afloat. ",{"#":"speaker_right"},"\n","^I don't get dropped off at the gate by a nice daddy car. I take the bloody bus. ",{"#":"speaker_right"},"\n","^Okay I really need to do a better job comforting her. Sharing my frustrations made it worse. ",{"#":"inner_monologue"},"\n","^You know Pushpa Aunty loves having you and Amma around! She sounded really excited. And it’s not a one-way thing, she needs us to help her out too. ",{"#":"speaker_self"},"\n","^Oh don’t pretend you’re happy about it, anna. You won’t be able to study with the noise. ",{"#":"speaker_right"},"\n","^Gah she knows me too well. ",{"#":"inner_monologue"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Revati, look at it this way. We’re in a really crappy situation now, but things can only get better from here. And at least you have my corny jokes to keep you laughing. Right? ",{"#":"speaker_self"},"\n","^… ",{"#":"speaker_right"},"\n","^We all know you’re not agreeing out loud because I’m your bro, but you love my jokes. ",{"#":"speaker_self"},"\n",{"#":"speaker_right_image:cha_ravi_revati_normal.png"},"^Ah, that smirk. Now she’s looking more herself. ",{"#":"inner_monologue"},"\n","^Shuddup anna (big brother). So annoying… ",{"#":"speaker_right"},"\n","^My pleasure. Eh don’t drop the sofa! ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_mum_dress_happy.png"},"^That took a while! ",{"#":"speaker_left"},"\n","^Yah… as a long as a sofa should take. ",{"#":"speaker_self"},"\n","^Don’t be rude, kanna! Maybe we just had more things that we thought we did. Now’s a good time to sell some extra clothes, jewellery… ",{"#":"speaker_left"},"\n","^There she goes, worrying about money again.  ",{"#":"inner_monologue"},"\n","^So, let’s see… Revati and I will sleep in the extra room. We can share Kamala’s old bed, for now.  ",{"#":"speaker_left"},"\n","^For washing up, we can use the small toilet, the one behind, near the kitchen.... ",{"#":"speaker_left"},"\n","^Wait a minute, what about me? Where should I sleep? ",{"#":"speaker_self"},"\n","^For tonight, you can sleep on the sofa. ",{"#":"speaker_left"},"\n","^Wait, on the sofa? ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_mum_dress_normal.png"},"^There just isn’t enough space in the extra room. I told you, there’s just Kamala’s bed. Revati and I will need to share it.  ",{"#":"speaker_left"},"\n","^There’s some room on the floor, but not enough to lay down a mattress. The sofa is better for your back. Better than the floor, anyway. ",{"#":"speaker_left"},"\n","^I still have an entire list of stuff you need to do, starting with clearing out the storage room.  ",{"#":"speaker_left"},"\n","^I haven’t even prepared for class yet...I have an early class tomorrow and Prof. Tan’s course is no joke. He already yelled at me for being just 2 minutes late once!  ",{"#":"inner_monologue"},"\n","^Not to mention, this place is so far from uni. it’s going to take, like, an extra hour to get there. ",{"#":"inner_monologue"},"\n","^Maybe I need to take a stand. ",{"#":"inner_monologue"},"\n","ev","str","^Comply","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Protest","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["^ I guess maybe I can do it tomorrow, if I come home from uni fast enough. ",{"#":"inner_monologue"},"\n","^I’ll have to cancel my other plans. This is more important. ",{"#":"inner_monologue"},"\n","ev",{"VAR?":"ravi_1_motherempathy"},1,"+",{"VAR=":"ravi_1_motherempathy","re":true},"/ev","^Ok sure. I’ll do it tomorrow, after school. ",{"#":"speaker_self"},"\n","^You can’t...we need to clear up everything. We can’t leave it lying around like this. ",{"#":"speaker_left"},"\n","^...ok, fine. I’ll do it, but not for too long. What do I need to do? ",{"#":"speaker_self"},"\n","^Just fold the cardboard boxes first. Then I’ll tell you. ",{"#":"speaker_left"},"\n","^There’s a lot more to be done. ",{"#":"speaker_left"},"\n","^Ok… ",{"#":"speaker_self"},"\n","^Sigh. ",{"#":"inner_monologue"},"\n","^I’ll pass you a blanket you can use when you sleep, after you’re done. Next, we have to- ",{"#":"speaker_left"},"\n","^Amma, I have an early class tomorrow... ",{"#":"speaker_self"},"\n","^You know the prof, the strict one I told you about?  ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_mum_dress_worried.png"},"^He’ll kill me if I go to his class late, or worse, fall asleep... ",{"#":"speaker_self"},"\n","^And my class is at 9. It’s so far away, I’ll need to leave at 7. At least Revati is near to her school. ",{"#":"speaker_self"},"\n",{"#":"speaker_right_image:cha_ravi_revati_concerned.png"},"^Oh. In that case, your sister and I will move everything. But you’ll have to help again tomorrow, ok? ",{"#":"speaker_left"},"\n",{"#":"speaker_right_image:cha_ravi_revati_normal.png"},"^Okay, I will. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["^ If this goes on, who knows when her “list of stuff” ends? I need to stop now, by any means necessary. ",{"#":"inner_monologue"},"\n","^Why ma! ",{"#":"speaker_self"},"\n","^Why what? ",{"#":"speaker_left"},"\n","^I’m so tired. I just want to crash! ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_mum_dress_worried.png"},"^Yeah you can. After you help clear up everything. We can’t leave it lying around like this. ",{"#":"speaker_left"},"\n","^Amma, I have an early class tomorrow! ",{"#":"speaker_self"},"\n","^So you want your sister and I to move everything? On our own? ",{"#":"speaker_left"},"\n","^I’ve already moved so much! ",{"#":"speaker_self"},"\n","^And my class is at 9. It’s so far away, I’ll need to leave at 7. ",{"#":"speaker_self"},"\n","^The prof will kill me if I go to his class late.  ",{"#":"speaker_self"},"\n","^At least Revati is near to her school. ",{"#":"speaker_self"},"\n",{"#":"speaker_right_image:cha_ravi_revati_concerned.png"},"^Can you do just a bit? ",{"#":"speaker_left"},"\n","^Amma, I wish I could, but I still haven’t prepared for tomorrow’s class yet. It’s already really late. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^Anna (brother), why don’t you help a bit? ",{"#":"speaker_right"},"\n","^Just whatever Amma needs for the storage room. Then we can all go to sleep. We can finish this quickly. ",{"#":"speaker_right"},"\n","^I think I’ll go stay in Lukman’s house tonight. His place is nearer to campus.  ",{"#":"speaker_self"},"\n","^Much easier to make it to class tomorrow. I’m sure he has an extra bed to spare me. ",{"#":"speaker_self"},"\n",{"#":"speaker_right_image:cha_ravi_revati_normal.png"},"^Besides, I don’t think I can get any rest on this sofa. Either my feet are dangling out, or I have to curl up like an armadillo. ",{"#":"speaker_self"},"\n","ev",{"VAR?":"ravi_1_motherempathy"},3,">=","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"ravi_1_2_empathy"},{"->":".^.^.^.22"},null]}],"nop","\n","ev",{"VAR?":"ravi_1_motherempathy"},3,"<","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"ravi_1_2_notempathy"},{"->":".^.^.^.30"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"ravi_1_2_empathy":[{"#":"knot:ravi_1_2_empathy"},{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^So much happened in those few days.","\n","^Moving out from a place we lived nearly all our lives, staying with Pushpa Aunty, and learning so much about Amma.","\n","^I tried my best to be there for her, and to comfort her.","\n","^Moving so many boxes, everything that we’ve ever owned, into a small room.","\n","^And all of that, on top of uni. I’m so tired.","\n","^I’m thankful we managed to stay with Pushpa Aunty – we can save money this way, for a while.","\n","^But I think I’ll just ask Lukman to help me with the readings, and I’ll just sleep as soon as I can.","\n","^I’m so tired, I could fall asleep just sitting...here...ZZZZZ…","\n",{"->":"ravi_1_3"},{"#f":1}],"ravi_1_2_notempathy":[{"#":"knot:ravi_1_2_notempathy"},{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^So much happened in those few days.","\n","^Moving out from a place we lived nearly all our lives, staying with Pushpa Aunty, and learning so much about Amma.","\n","^Moving so many boxes, everything that we’ve ever owned, into a small room.","\n","^And all of that, on top of uni. I’m so tired.","\n","^I don't know why this had to happen to us, again. Why am I so unlucky?","\n","^Why can't my life just be a little easier?","\n","^I guess I should be grateful that at least we managed to stay with Pushpa Aunty – we can save money this way, for a while.","\n","^But I think I’ll just ask Lukman to help me with the readings, and I’ll just sleep as soon as I can.","\n","^I’m so tired, I could fall asleep just sitting...here...ZZZZZ…","\n",{"->":"ravi_1_3"},{"#f":1}],"ravi_1_3":[{"#":"knot:ravi_1_minigame"},{"#":"ui:mcq"},{"#":"game_id:7"},"^Minigame 7","\n",{"#":"knot:ravi_1_3"},{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^It’s been two weeks since we’ve made the move.","\n","^But I can’t do this forever though. I can’t go to Lukman’s almost every day. He’s probably getting sick of my face already. The first time was fun, kind of like a sleepover.","\n","^The second time was like we were roommates. The third, fourth, fifth times...he’s probably expecting me to pay rent or something.","\n","^His parents must be really annoyed with me too. They don’t say it, but I can feel their eyes in the back of my skull whenever I go over. I can’t keep being a burden to Lukman either.","\n","^I need to find some other place to stay. Maybe stay on my own if I can. That might be nice, for a change. I’ve always shared a room with Revati, anyway.","\n",{"#":"background:bg_ravi_rentals1.jpg"},"^I’ve been scouring so many websites, trying to find a good place to rent. PropertyMagic, 999co, Room4Rent – you name it, I’ve tried it.","\n","^Hmm... rental properties might be hard to find with my tight budget.","\n",{"->":"ravi_1_4_narration"},{"#f":1}],"ravi_1_4_narration":[{"#":"knot:ravi_1_4_narration"},{"#":"ui:scene"},{"#":"background:bg_ravi_rentals1.jpg"},"^Hmm...this listing sounds good. one bedroom apartment, 11th floor, 5 minutes away from university? This must be a dream... wait $2222 per month?? This must be a nightmare! Who can afford that? Maybe if I just sort by “price”… ",{"#":"inner_monologue"},"\n",{"#":"background:bg_ravi_rentals2.jpg"},"^Oh, this room sounds about right. Seems promising. It’s a small room – maybe other people are staying there too? But it’s cheap, and pretty close to uni. ",{"#":"inner_monologue"},"\n","^Maybe I can make friends with whoever’s staying there. Or better yet, I might be able to talk them down to my price. They should take some pity on a student.",{"#":"inner_monologue"},"\n",{"#":"background:bg_ravi_rentals3.jpg"},"^Let me see if he’s offering any other rooms ... oh wow, he has two! Maybe I can rent the other room instead – it’s a bit bigger though, so it’s probably more expensive... I’ll see how it goes.",{"#":"inner_monologue"},"\n","^Who do I talk to? I see an agent’s name here. “Agent James” huh? Sounds like a reliable guy. Actually, no. Sounds like James Bond wannabe.",{"#":"inner_monologue"},"\n","^Oh, his phone number is here. Maybe I should drop him a text. Well, here goes nothing.",{"#":"inner_monologue"},"\n",{"->":"ravi_1_4"},{"#f":1}],"ravi_1_4":[[{"#":"knot:ravi_1_4"},{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^Hi, is this James? ",{"#":"speaker_self"},"\n","^I saw the listing on Room4Rent. The one for two different rooms? ",{"#":"speaker_self"},"\n","^I would like to rent a room, if that’s possible! ",{"#":"speaker_self"},"\n","^Hi, yes! This is James. Pleasure to “e-meet” you. ",{"#":"speaker_1"},"\n","^The one in Clementi? ",{"#":"speaker_1"},"\n","^Still available. Got two - big room with bathroom and a smaller room ",{"#":"speaker_1"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^Ah...nobody I know says “e-meet”. This man must be a professional agent after all! This looks good. Maybe I’ll be able to get a room faster than I thought. ",{"#":"inner_monologue"},"\n",{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^Great! Yes, I am interested in the rooms. ",{"#":"speaker_self"},"\n","^Which room you're interested in? ",{"#":"speaker_1"},"\n","^The smaller room please. ",{"#":"speaker_self"},"\n","^The one for $500 per month. ",{"#":"speaker_self"},"\n","^It’s shared housing you know right? The landlord is staying there also. ",{"#":"speaker_1"},"\n","^Yep! That’s fine with me. ",{"#":"speaker_self"},"\n","^Ok, how many people are renting? ",{"#":"speaker_1"},"\n","^The landlord got strict policy - only one tenant per room. ",{"#":"speaker_1"},"\n","^Yeah, I understand. ",{"#":"speaker_self"},"\n","^It’ll just be me renting the room. Don’t worry about it. ",{"#":"speaker_self"},"\n","^Will you have visitors over? ",{"#":"speaker_1"},"\n","^No...no girlfriend. Don’t think my family will visit either. ",{"#":"speaker_self"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^Wow… way to rub it in. Was that really necessary? But ok, I can work on that next time. The room is more important. ",{"#":"inner_monologue"},"\n",{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^Ok, no girlfriend right? Great. ",{"#":"speaker_1"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^Great, he says. Sheeeeesh! ",{"#":"inner_monologue"},"\n",{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^To rent the room, there’s a process we need to go through. ",{"#":"speaker_1"},"\n","^Firstly, can I have your profile? ",{"#":"speaker_1"},"\n","^Profile? Sorry, what do you mean? ",{"#":"speaker_self"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^What kind of profile? You’re setting up a dating profile for me ah? ",{"#":"inner_monologue"},"\n",{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^What are you doing? Working here? ",{"#":"speaker_1"},"\n","^Oh. That’s what you meant by profile. ",{"#":"speaker_self"},"\n","^Nah, I’m just a student. Still studying in uni. ",{"#":"speaker_self"},"\n","^Ok. What’s your background? ",{"#":"speaker_1"},"\n","^I’m sorry. Background? ",{"#":"speaker_self"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^I think if I say my background is currently a blank wall he’ll just block me. ",{"#":"inner_monologue"},"\n",{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^Your details lah. ",{"#":"speaker_1"},"\n","^Name, IC all that. ",{"#":"speaker_1"},"\n","^Just fill up for me. ",{"#":"speaker_1"},"\n","^Name:  /n  Pax:  /n  Occupation:  /n  Ethnicity:  /n Budget:  /n Years of lease:  /n  Expected shift in date:  /n  ",{"#":"speaker_1"},"\n","ev","str","^Agree to fill in the details","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Just insist on getting the rental details","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Sure, give me a second, ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^  I just need the small room for $500. Can you please send over the details? ",{"#":"speaker_self"},"\n","^Yes, available. But I need to know your details first. Standard procedure. ",{"#":"speaker_1"},"\n","^Aiyoh. Ok, ok, fine. Totally not relevant though. ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Done, here you go. /n Name: Ravi Kannasamy /n Pax: 1  /n Occupation: Student  /n Ethnicity: Indian  /n Budget: $500  /n Years of lease: 1  /n  Expected shift in date: Aug 20 ",{"#":"speaker_self"},"\n","^Ok, great. I check with landlord first. ",{"#":"speaker_1"},"\n","^Ok, thank you! ",{"#":"speaker_self"},"\n","^15:02 ",{"#":"timestamp"},"\n","^Hi Ravi. ",{"#":"speaker_1"},"\n","^That was fast. ",{"#":"speaker_self"},"\n","^So, what did he say? ",{"#":"speaker_self"},"\n","^Sorry, landlord says cannot. ",{"#":"speaker_1"},"\n","^But don’t worry. I have other room for you.  ",{"#":"speaker_1"},"\n","^Other location. You want? Yishun got one room. Jurong also got. ",{"#":"speaker_1"},"\n","^Sorry, why cannot? Was the room already taken? I can still take the bigger room. ",{"#":"speaker_self"},"\n","^Sorry, no. The room isn’t taken yet. ",{"#":"speaker_1"},"\n","^Huh? Then what? ",{"#":"speaker_self"},"\n","^Landlord say this room not suitable for Indian, sorry. ",{"#":"speaker_1"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^WHAT?!? What does he mean the room not suitable for Indians? Oh god is this one of those horrible landlords I've read about online? I never thought this would happen to me.  ",{"#":"inner_monologue"},"\n",{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^Uh.... ",{"#":"speaker_self"},"\n","ev","str","^Stay polite","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Get angry","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["^ Why is it not suitable? ",{"#":"speaker_self"},"\n","^I don’t know lah. ",{"#":"speaker_1"},"\n","ev","str","^polite","/str","/ev",{"VAR=":"ravi_1_agent","re":true},"^Landlord just say cannot. I also really can’t ask him why. ",{"#":"speaker_1"},"\n","^I also don’t know what he’ll say if I do ask. Sometimes landlord just tells me these things and my job is just to tell you. ",{"#":"speaker_1"},"\n","^Wait, is this because of the whole Indian cooking thing? ",{"#":"speaker_self"},"\n","^I’ve seen people post horror stories like this online before. ",{"#":"speaker_self"},"\n","^Just tell him that the only thing I know how to cook are instant noodles! 😂😂  ",{"#":"speaker_self"},"\n","^Uh I think it’s not just cooking la.  ",{"#":"speaker_1"},"\n","^What do you mean, not just cooking? Tell me, what else? ",{"#":"speaker_self"},"\n","^Aiyah, I don’t know la. ",{"#":"speaker_1"},"\n","^The landlord say no Indian. His property, his decision right? I can’t argue with him also. If he angry then later he change agent. ",{"#":"speaker_1"},"\n","^Don’t worry, I have other room for you. I have a good room in Yishun for you. ",{"#":"speaker_1"},"\n","^But Yishun is too far from my uni. ",{"#":"speaker_self"},"\n","^Yishun is too far from everything! This place is close to my uni. It’s the perfect place for me. ",{"#":"speaker_self"},"\n",["ev","str","^Try to persuade landlord that I am not like \"those\" Indians","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Accept the landlord's decision","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Eh but you tell him that I don't cook, and I'm a student in university ok. Very clean. Not like what he might think or hear from others. ",{"#":"speaker_self"},"\n","ev",1,"/ev",{"VAR=":"ravi_1_notlikeotherindians","re":true},"^Aiyah why so troublesome? Eh pls understand I cannot do anything without landlord permission. I don't think he will care about those reasons la, trust me. Not like I don’t want to help you ok! ",{"#":"speaker_1"},"\n","^Yes, but this is not right. ",{"#":"speaker_self"},"\n","^Right, not right, the landlord decided lah. ",{"#":"speaker_1"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^ Sigh. I don't think this is right but what can I do la. ",{"#":"speaker_self"},"\n","ev",0,"/ev",{"VAR=":"ravi_1_notlikeotherindians","re":true},{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^I guess this is what the older generation are like. Even the government said that they are not willing to accept a non-Chinese as their Prime Minister, so I guess this is their mental model. Sigh. ",{"#":"inner_monologue"},"\n",{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^Fine.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^But you seem like a nice guy. Let me see what I can do to help. ",{"#":"speaker_1"},"\n","^What about the room in Jurong? ",{"#":"speaker_1"},"\n","^I check on the other room for you? ",{"#":"speaker_1"},"\n","^Yes please. The one in Jurong. How much is that? ",{"#":"speaker_self"},"\n","^Cheaper. $450 only. ",{"#":"speaker_1"},"\n","^Smaller room but only one other person in the house. Landlord not staying there. ",{"#":"speaker_1"},"\n",{"->":"ravi_1_4.0.g-1"},{"#f":5}]}],{"#f":5}],"c-3":["^ Why is it not suitable? ",{"#":"speaker_self"},"\n","^I don’t know lah. ",{"#":"speaker_1"},"\n","ev","str","^angry","/str","/ev",{"VAR=":"ravi_1_agent","re":true},"^Landlord just say cannot. I also really cannot ask him why. ",{"#":"speaker_1"},"\n","^This is ridiculous. ",{"#":"speaker_self"},"\n","^You are saying no because of me being Indian? ",{"#":"speaker_self"},"\n","^No no not me! Is the landlord's decision. I want also cannot do anything. ",{"#":"speaker_1"},"\n","^Did you even check with the landlord? ",{"#":"speaker_self"},"\n","^You replied within 2 minutes. ",{"#":"speaker_self"},"\n","^Yes, I did. He replied me very fast ",{"#":"speaker_1"},"\n",["ev","str","^Try to persuade landlord that you are not like \"those\" Indians","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Criticise the Agent's handling","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Did you tell him I’m Singaporean? ",{"#":"speaker_self"},"\n","ev",1,"/ev",{"VAR=":"ravi_1_notlikeotherindians","re":true},"^Yes ",{"#":"speaker_1"},"\n","^And? What did he say? I am local born ok! Did NS! ",{"#":"speaker_self"},"\n","^Sorry, landlord said no Indian. Said all types cannot. Sorry.  ",{"#":"speaker_1"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^ I think this is just you making this up. ",{"#":"speaker_self"},"\n","ev",0,"/ev",{"VAR=":"ravi_1_notlikeotherindians","re":true},"^You scared the house will smell of curry is it? ",{"#":"speaker_self"},"\n","^It’s not just your smell lah. ",{"#":"speaker_1"},"\n","^Not JUST smell? So you think Indian got a smell issit? ",{"#":"speaker_self"},"\n","^No, that’s not what I meant. ",{"#":"speaker_1"},"\n","^I mean it’s not just your cooking lah. ",{"#":"speaker_1"},"\n","^First of all, I’m NOT going to be cooking ok. ",{"#":"speaker_self"},"\n","^Secondly, whether I cook or not is not important. SO it’s ok for other people to cook, but not Indians? ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Eh, I'm not the bad guy la. The landlord say no Indian. Not I say. ",{"#":"speaker_1"},"\n","^His property, his decision right? I can’t argue with him also. If he angry then later he change agent. ",{"#":"speaker_1"},"\n","^Don’t worry, I have other room for you. ",{"#":"speaker_1"},"\n","^I have a good room in Yishun for you. ",{"#":"speaker_1"},"\n","^I want nothing from a racist agent. ",{"#":"speaker_self"},"\n","^Hello boss. Don’t anyhow throw name like that. ",{"#":"speaker_1"},"\n","^I didn’t say no ok. It’s the landlord. ",{"#":"speaker_1"},"\n","^It’s not my choice whether you can rent the room ok? ",{"#":"speaker_1"},"\n","^I’m trying to help you also. Not like I say you can stay means you can what. ",{"#":"speaker_1"},"\n","^Huh then he say no Indian, you just reply ok. You’re not helping me. Have you at least tried convincing him to let me stay? ",{"#":"speaker_self"},"\n","^I told you I can’t argue with him. I don’t want him to change agent. Anyway you know how people are like lah. ",{"#":"speaker_1"},"\n","^What do you mean? Racist people? ",{"#":"speaker_self"},"\n","^Aiyah, you know how some people are like that. Times changed but their mindsets still from don’t know when. This landlord older generation la. Even gahmen also say they  not ready for a non-chinese prime minister! ",{"#":"speaker_1"},"\n","^Anyway even if I argue with him, you want to stay with him meh? He’s staying at the place eh. Don’t know what he’ll treat you like in person with this kind of mindset. ",{"#":"speaker_1"},"\n","^I have another room in Yishun. You interested? I think this landlord is better la. Don’t worry about this one. I can’t do more than that already. ",{"#":"speaker_1"},"\n","^Please understand. I’m only the agent. ",{"#":"speaker_1"},"\n","^Yishun is too far. ",{"#":"speaker_self"},"\n","^The room in Jurong. How much is that? ",{"#":"speaker_self"},"\n","^Cheaper. $450 only. ",{"#":"speaker_1"},"\n","^Smaller room but only one other person in the house. Landlord no stay. No problem. ",{"#":"speaker_1"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},{"->":"ravi_1_4.0.g-1"},{"#f":5}]}],{"#f":5}],"#f":5}],"g-1":["^Why do I feel like a foreigner in my own country? I don’t want to be forced into a house like this. ",{"#":"inner_monologue"},"\n","^I thought “regardless of race”? Did we not say it every damn morning like machines? Or is there a different pledge for landlords? ",{"#":"inner_monologue"},"\n","^But damn, a room for myself for $450 sounds good. Maybe I should check with the uni as well though. See if they have any options for me. ",{"#":"inner_monologue"},"\n",{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Property Agent James"},{"#":"chat_group_image:ico_ravi_james.png"},{"#":"speaker_1_name:James"},"^Hmm, sounds good.  ",{"#":"speaker_self"},"\n","^Ok. So how? Can? ",{"#":"speaker_1"},"\n","ev","str","^Try looking for university housing","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Yup, sounds good! I'll take it.","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["^ Let me get back to you later? ",{"#":"speaker_self"},"\n",{"->":"ravi_1_5_narration"},{"#f":5}],"c-5":["^  Yup, I'll take it.  ",{"#":"speaker_self"},"\n",{"->":"chapter_1_ending_2b"},{"#f":5}],"#f":5}]}],{"#f":1}],"ravi_1_5_narration":[{"#":"knot:ravi_1_5_narration"},{"#":"ui:narrator"},{"#":"background:ui_emailinbox.png"},"^Maybe I should try emailing the uni. Maybe I can get a room if I’m lucky enough. I’ve always wanted to try and stay on campus, anyway. Seems fun.","\n","ev",1,"/ev",{"VAR=":"ravi_1_emailuniversity","re":true},"^Let’s just hope the school admin is better than the agent…","\n",{"->":"ravi_1_5"},{"#f":1}],"ravi_1_5":[{"#":"knot:ravi_1_5"},{"#":"ui:email"},{"#":"emailheader:Compose Email"},{"#":"emailfrom:Ravi <ravi@email.com>"},{"#":"emailfromicon: ico_ravi_ravi.png"},{"#":"emailto:Univ Housing <admin@univ.edu.sg>"},{"#":"emailsubject: Query about dorm room"},"^To whom it may concern, ",{"#":"speaker_self"},"\n","^I’m writing to inquire about the possibility of housing in the university dorm. My student number is A0155007R. ",{"#":"speaker_self"},"\n","^I understand that I might be a little late, but I need to move out immediately due to family matters. It would be great if I could stay on campus, if possible.  ",{"#":"speaker_self"},"\n","^Do let me know if there are any options available. Any room is fine. Please let me know if you need more details.",{"#":"speaker_self"},"\n","^Thank you, ",{"#":"speaker_self"},"\n","^Ravi ",{"#":"speaker_self"},"\n",{"#":"ui:narrator"},{"#":"background:ui_emailsending.png"},"^Ok, that sounded formal enough….","\n",{"#":"background:ui_emailsent.png"},"^Oh, they replied already! That was quick. Let’s see…","\n",{"->":"ravi_1_5a"},{"#f":1}],"ravi_1_5a":[{"#":"knot:ravi_1_5a"},{"#":"ui:emailinbox"},{"#":"newemailfrom: Rebecca"},{"#":"newemailprofileicon:ico_ravi_rebecca.png"},{"#":"newemailsubject:Query about dorm room"},{"#":"newemailpreview: Hello Ravi, Thanks for your email. I'm ..."},"^.","\n",{"->":"ravi_1_5b"},{"#f":1}],"ravi_1_5b":[{"#":"knot:ravi_1_5b"},{"#":"ui:email"},{"#":"emailheader:Read Email"},{"#":"emailfrom:Univ Housing <admin@univ.edu.sg>"},{"#":"emailto:Ravi <ravi@email.com>"},{"#":"emailfromicon: ico_ravi_rebecca.png"},{"#":"emailsubject: Query about dorm room"},{"#":"replyemaildate:On Wed 6 Oct 2021, Ravi <ravi@email.com> wrote:"},{"#":"replyemailtext: To whom it may concern /n I’m writing to inquire about the possibility of housing in the university dorm. My student number is A0155007R. /n I understand that I might be a little late, but I need to move out immediately due to family matters. It would be great if I could stay on campus, if possible. /n Do let me know if there are any options available. Any room is fine. Please let me know if you need more details.  /n Thank you, /n Ravi"},"^Hello Ravi, /n /n Thanks for your email. I’m afraid you are a little late. Housing occupancy has been settled before the beginning of the semester. You would need to wait for the next semester to get a room. /n /n You mentioned that you had to move due to family matters. While we may not be currently able to offer you a room, the school is concerned for the wellbeing of its students. Is there anything else we could do to help? /n /n  Regards, /n  Rebecca ",{"#":"speaker_1"},"\n",{"#":"ui:narrator"},{"#":"background:ui_emailinbox.png"},"^Ah, I knew it. Rooms on campus are always snapped up.","\n",{"->":"ravi_1_5c"},{"#f":1}],"ravi_1_5c":[{"#":"knot:ravi_1_5c"},{"#":"ui:email"},{"#":"emailheader:Compose Email"},{"#":"emailto:Univ Housing <admin@univ.edu.sg>"},{"#":"emailfrom:Ravi <ravi@email.com>"},{"#":"emailfromicon: ico_ravi_ravi.png"},{"#":"emailsubject: Query about dorm room"},{"#":"replyemaildate:On Wed 6 Oct 2021, Univ Housing <admin@univ.edu.sg> wrote:"},{"#":"replyemailtext: Hello Ravi, /n I’m afraid you are a little late. Housing occupancy has been settled before the beginning of the semester. You would need to wait for the next semester to get a room. /n You mentioned that you had to move due to family matters. While we may not be currently able to offer you a room, the school is concerned for the wellbeing of its students. Is there anything else we could do to help? /n Regards, /n /n Rebecca"},"^Hello Rebecca,  ",{"#":"speaker_self"},"\n","^Thank you for your reply.  ",{"#":"speaker_self"},"\n","^I am a little out of options. I don’t have space at home to study or sleep, and I would really love if I could somehow stay on campus. ",{"#":"speaker_self"},"\n","^I hope you could check for me whether there was any space left in the dorm at all. Like I said, I’m ok to take any room. ",{"#":"speaker_self"},"\n","^Thank you, ",{"#":"speaker_self"},"\n","^Ravi ",{"#":"speaker_self"},"\n",{"#":"ui:narrator"},{"#":"background:ui_emailsending.png"},"^Maybe I have to go with the Agent after all.","\n",{"#":"background:ui_emailsent.png"},"^Wait, a reply just came in. Wah this Rebecca is super on the ball.","\n",{"->":"ravi_1_5c2"},{"#f":1}],"ravi_1_5c2":[{"#":"knot:ravi_1_5c2"},{"#":"ui:emailinbox"},{"#":"newemailfrom: Rebecca"},{"#":"newemailprofileicon:ico_ravi_rebecca.png"},{"#":"newemailsubject: Query about dorm room"},{"#":"newemailpreview: Hello Ravi, We have one room available ..."},"^.","\n",{"->":"ravi_1_5d"},{"#f":1}],"ravi_1_5d":[[{"#":"knot:ravi_1_5d"},{"#":"ui:email"},{"#":"emailheader:Read Email"},{"#":"emailfrom:Univ Housing <admin@univ.edu.sg>"},{"#":"emailfromicon: ico_ravi_rebecca.png"},{"#":"emailto:Ravi <ravi@email.com>"},{"#":"emailsubject: Query about dorm room"},{"#":"replyemaildate:On Wed 6 Oct 2021, Ravi <ravi@email.com> wrote:"},{"#":"replyemailtext: Hello Rebecca, /n Thank you for your reply. /n I am a little out of options. I don’t have space at home to study or sleep, and I would really love if I could somehow stay on campus. /n I hope you could check for me whether there was any space left in the dorm at all. Like I said, I’m ok to take any room.  /n Thank you, /n Ravi"},"^Hello Ravi, /n /n We have one room available now but I'm actually supposed to release it later. One of the foreign exchange students is moving back home for an emergency next week. Given your difficult situation, I think I can offer it to you first. /n  /n It’s a single room in the Farquhar Hall with an aircon. There is a shared bathroom on the same floor. The room’s $700 per month, without food. If you want food, you’ll have to choose a meal plan. /n  /n Would you like to take the room? If so, please let me know as soon as possible so that the school can make the necessary arrangements. /n /n Regards, /n Rebecca ",{"#":"speaker_1"},"\n",{"#":"ui:narrator"},{"#":"background:ui_emailinbox.png"},"^At least it’s an option. But ... it’s a little over budget. My savings are enough for $450 a month, but $700 is a stretch for now.","\n","^On the other hand, I’ll never be late for class again! I might save money on transport too. And I won’t have to deal with any racist landlords.","\n","ev","str","^Take the dorm room","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Decline the room, take the rental","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"ravi_1_5e_take"},"\n",{"#f":5}],"c-1":["^ ",{"->":"ravi_1_5e_decline"},"\n",{"#f":5}]}],{"#f":1}],"ravi_1_5e_take":[{"#":"knot:ravi_1_5e_take"},{"#":"ui:email"},{"#":"emailheader:Compose Email"},{"#":"emailto:Univ Housing <admin@univ.edu.sg>"},{"#":"emailfrom:Ravi <ravi@email.com>"},{"#":"emailfromicon: ico_ravi_ravi.png"},{"#":"emailsubject: Query about dorm room"},{"#":"replyemaildate:On Wed 6 Oct 2021, Univ Housing <admin@univ.edu.sg> wrote:"},{"#":"replyemailtext: Hello Ravi,  /n Good news! We have one room available now. One of the foreign exchange students is moving back home for an emergency.  /n It’s a single room in the Farquhar Hall with an aircon. There is a shared bathroom on the same floor. The room’s $700 per month, without food. If you want food, you’ll have to choose a meal plan.  /n Would you like to take the room? If so, please let me know as soon as possible so that the school can make the necessary arrangements.  /n Regards,   /n Rebecca"},"^Hello Rebecca, ",{"#":"speaker_self"},"\n","ev",1,"/ev",{"VAR=":"ravi_1_dormhousing","re":true},"^Thank you so much! I would like to take the room. It would be amazing to stay on campus, and this solves a few of my problems! ",{"#":"speaker_self"},"\n","^I’m ok without the meal plan. Please let me know what else I need to do to move in! ",{"#":"speaker_self"},"\n","^Thank you, ",{"#":"speaker_self"},"\n","^Ravi ",{"#":"speaker_self"},"\n",{"#":"ui:narrator"},{"#":"background:ui_emailsending.png"},"^.","\n",{"#":"background:ui_emailsent.png"},"^.","\n",{"->":"ravi_1_5e_take2"},{"#f":1}],"ravi_1_5e_take2":[{"#":"knot:ravi_1_5e_take2"},{"#":"ui:email"},{"#":"emailheader:Read Email"},{"#":"emailfrom:Univ Housing <admin@univ.edu.sg>"},{"#":"emailfromicon: ico_ravi_rebecca.png"},{"#":"emailto:Ravi <ravi@email.com>"},{"#":"emailsubject: Query about dorm room"},{"#":"replyemaildate:On Wed 6 Oct 2021, Ravi <ravi@email.com> wrote:"},{"#":"replyemailtext: Hello Rebecca, /n Thank you so much! I would like to take the room. It would be amazing to stay on campus, and this solves a few of my problems! /n I’m ok without the meal plan. Please let me know what else I need to do to move in!  /n Thank you, /n Ravi"},"^Hello Ravi,  /n /n Great! Please let me know your earliest possible move-in date, so we can arrange for the access card and keys. There are forms to fill up which I will follow up with in a separate email. /n /n There will most likely be an orientation session at the dorm as well, with the Residential Assistant. Each floor has a Residential Assistant, who is a student volunteer assigned to deal with any issues faced by the students living in the dorm.  /n Hope you will enjoy the rest of your semester staying on campus! /n /n Regards,  /n Rebecca ",{"#":"speaker_1"},"\n",{"->":"chapter_1_ending_1"},{"#f":1}],"chapter_1_ending_1":[{"#":"knot:chapter_1_ending_1"},{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^Yes! I don’t know how this will go, but at least I don’t have to deal with stupid questions from the agent. And I’ll definitely save on transport.","\n","ev",1,"/ev",{"VAR=":"chapter_1_ending","re":true},"^It sounds like I’ll be able to make some friends too. Orientation? This feels like year one all over again. Not that I mind, it does sound fun.","\n","^Maybe I’ll finally find a girlfriend? Then I can tell the agent off. Man, why did he have to ask whether I have a girlfriend or not?","\n","^Anyhow, cheers to independence! I’ve taken a further step in adulting, and I guess that’s something to be proud of…","\n","^Better let Amma know the news.","\n",{"->":"ravi_1_reflection"},{"#f":1}],"ravi_1_5e_decline":[{"#":"knot:ravi_1_5e_decline"},{"#":"ui:email"},{"#":"emailheader:Compose Email"},{"#":"emailto:Univ Housing <admin@univ.edu.sg>"},{"#":"emailfrom:Ravi <ravi@email.com>"},{"#":"emailfromicon: ico_ravi_ravi.png"},{"#":"emailsubject: Query about dorm room"},{"#":"replyemaildate:On Wed 6 Oct 2021, Univ Housing <admin@univ.edu.sg> wrote:"},{"#":"replyemailtext: Hello Ravi,  /n Good news! We have one room available now. One of the foreign exchange students is moving back home for an emergency.  /n It’s a single room in the Farquhar Hall with an aircon. There is a shared bathroom on the same floor. The room’s $700 per month, without food. If you want food, you’ll have to choose a meal plan.  /n Would you like to take the room? If so, please let me know as soon as possible so that the school can make the necessary arrangements.  /n Regards,   /n Rebecca"},"^Hello Rebecca,  ",{"#":"speaker_self"},"\n","^Thank you so much. ",{"#":"speaker_self"},"\n","ev",0,"/ev",{"VAR=":"ravi_1_dormhousing","re":true},"^Unfortunately, the room is a little too expensive for me at the moment. As such, I am unable to take the room. ",{"#":"speaker_self"},"\n","^Apologies for any inconvenience caused. I hope you find somebody to take that room soon. ",{"#":"speaker_self"},"\n","^Thank you, ",{"#":"speaker_self"},"\n","^Ravi ",{"#":"speaker_self"},"\n",{"#":"ui:narrator"},{"#":"background:ui_emailsending.png"},"^.","\n",{"#":"background:ui_emailsent.png"},"^.","\n",{"->":"ravi_1_5e_decline2"},{"#f":1}],"ravi_1_5e_decline2":[{"#":"knot:ravi_1_5e_decline2"},{"#":"ui:email"},{"#":"emailheader:Read Email"},{"#":"emailfrom:Univ Housing <admin@univ.edu.sg>"},{"#":"emailfromicon: ico_ravi_rebecca.png"},{"#":"emailto:Ravi <ravi@email.com>"},{"#":"emailsubject: Query about dorm room"},{"#":"replyemaildate:On Wed 6 Oct 2021, Ravi <ravi@email.com> wrote:"},{"#":"replyemailtext: Hello Rebecca, /n Thank you so much. Unfortunately, the room is a little too expensive for me at the moment. As such, I am unable to take the room. /n Apologies for any inconvenience caused. I hope you find somebody to take that room soon.  /n Thank you, /n Ravi"},"^Hello Ravi, /n /n We understand. In that case, unfortunately, you will have to make other arrangements. /n I can keep an eye out for a room opening up, but nothing else is available at the moment. I can’t guarantee that any rooms will be cheaper though. /n /n  All the best. Please feel free to contact the school if you require any financial assistance. /n /n Regards, /n Rebecca ",{"#":"speaker_1"},"\n",{"->":"chapter_1_ending_2"},{"#f":1}],"chapter_1_ending_2":[{"#":"knot:chapter_1_ending_2"},{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^Sigh. This is way over my budget. But I’m not going to apply for financial assistance. I don’t want to be THAT guy. I'll find a way to make the cash.","\n","^It’s still better than sleeping on that sofa though.","\n","^Looks like I have to deal with finding my own room and agents again.  I should try to get back at that racist landlord and agent...Maybe I post the convo online?","\n","^Hmm... actually I don’t want to end up on Mothership and read through all the comments. Just makes my own life harder later if people think of me as that troublesome tenant.","\n","^I’ll just take the room in Jurong and be done with it. Save some money. Don’t think I can get a better deal.","\n","ev",0,"/ev",{"VAR=":"ravi_1_dormhousing","re":true},"ev",2,"/ev",{"VAR=":"chapter_1_ending","re":true},"^Hope this landlord is better.","\n","^Better let Amma know the news. Anyhow, cheers to independence! I’ve taken a further step in adulting, and I guess that’s something to be proud of…","\n",{"->":"ravi_1_reflection"},{"#f":1}],"chapter_1_ending_2b":[{"#":"knot:chapter_1_ending_2b"},{"#":"ui:narrator"},{"#":"background:bg_ravi_pushpa_home.jpg"},"^I’ll just take the room in Jurong and be done with it. Save some money. Don’t think I can get a better deal.","\n","ev",0,"/ev",{"VAR=":"ravi_1_dormhousing","re":true},"ev",2,"/ev",{"VAR=":"chapter_1_ending","re":true},"^Hope this landlord is better.","\n","^Better let Amma know the news. Anyhow, cheers to independence! I’ve taken a further step in adulting, and I guess that’s something to be proud of…","\n",{"->":"ravi_1_reflection"},{"#f":1}],"ravi_1_reflection":[{"#":"knot:ravi_1_reflection"},{"#":"ui:chapter_reflection"},{"#":"reflection_id:7"},"^Reflection 7","\n",{"->":"ravi_2_intro"},{"#f":1}],"ravi_2_intro":[{"#":"knot:ravi_2_intro"},{"#":"ui:narrator"},{"#":"background:bg_ravi_bedroom.jpg"},"^One month after the move. ",{"#":"title"},"\n","^Moving out on my own was rough.","\n","^Amma didn’t take the news well, as expected. She preferred me to save money and stay home.","\n","^But I need to focus on my studies so that I can do well and get us out of this rut.","\n","^Saving rental money versus failing out of university ... the choice was clear to me.","\n","^But she was right, the monthly rent was a big bite out of my small savings.","\n","ev",2,"/ev",{"VAR=":"chapter_id","re":true},{"#":"background:black.jpg"},"^CHAPTER ","ev",{"VAR?":"chapter_id"},"out","/ev","^ ",{"#":"title"},"\n","^Coffee Shop Kannasamy ",{"#":"title"},"\n",{"->":"ravi_2_1_narration"},{"#f":1}],"ravi_2_1_narration":[{"#":"knot:ravi_2_1_narration"},{"#":"ui:narrator"},{"#":"background:bg_ravi_bedroom.jpg"},"ev",{"VAR?":"ravi_1_dormhousing"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^At least in the dorm I’ve got more time to study.","\n","^And make a few friends, which is a luxury I could not afford before. I’m so glad I don’t have to deal with bad landlords.","\n",{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["\n","^At least in this rental room I’ve got peace and quiet to study, and nobody to distract or bother me.","\n","^And this landlord seems pretty chill. I guess not all of them are bad la.","\n",{"->":".^.^.^.10"},null]}],"nop","\n","^I miss my family though, being here alone.","\n",{"->":"ravi_2_1"},{"#f":1}],"ravi_2_1":[[{"#":"knot:ravi_2_1"},{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Revati"},{"#":"chat_group_image:ico_ravi_revati.png"},{"#":"speaker_1_name:Revati"},{"#":"timestamp:21.34"},"^Hey Thangachi (little sister) ",{"#":"speaker_self"},"\n","^How have you guys been doing ",{"#":"speaker_self"},"\n","^Just wanted to check in ",{"#":"speaker_self"},"\n","^Aww ",{"#":"speaker_1"},"\n","^Do you miss us? ",{"#":"speaker_1"},"\n","^I’d be lying if I say I didn’t ",{"#":"speaker_self"},"\n","^Living on my own is kind of new for me ",{"#":"speaker_self"},"\n","^Yeah.  It’s weird to not see you around ",{"#":"speaker_1"},"\n","^But I mean all is good. Amma is looking for a job ",{"#":"speaker_1"},"\n","^And I’m getting rekt by my exam ten year series. Thanks for buying that for me btw. But I’ll manage ",{"#":"speaker_1"},"\n","^How about you? Room good? Have you put up all your ugly posters already? There's still a box of them left here  ",{"#":"speaker_1"},"\n","^Well... it’s as good as it’ll get ",{"#":"speaker_self"},"\n","^Living on my own is surprisingly expensive ",{"#":"speaker_self"},"\n","^I didn’t realise how much money I had to spend... like on food alone ",{"#":"speaker_self"},"\n","^Don’t know is it because I eat too much or my taste buds spoiled by Amma's cooking ",{"#":"speaker_self"},"\n","^But yeah like my savings are running out at this rate ",{"#":"speaker_self"},"\n","^I need to see how I can cut costs ",{"#":"speaker_self"},"\n","^Have you considered looking for a part time job? ",{"#":"speaker_1"},"\n","ev","str","^I know I should","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I want to focus on studies","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ I know I should… I haven’t ",{"#":"speaker_self"},"\n","^But I don’t have the time right now to look for one ",{"#":"speaker_self"},"\n","^Classes are busy and I’m looking for an internship too ",{"#":"speaker_self"},"\n","^Can’t do both at once ",{"#":"speaker_self"},"\n","^Anyway I don’t think anybody will hire at short notice ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^ I just want to focus on school for now. ",{"#":"speaker_self"},"\n","^Classes are busy and I’m looking for an internship too ",{"#":"speaker_self"},"\n","^Can’t do both at once ",{"#":"speaker_self"},"\n","^Anyway I have a better way to save money. Just eat maggi mee every day for almost every meal! ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Btw can you tell Pushpa Aunty I won’t be coming over for dinner today? ",{"#":"speaker_self"},"\n","^I have something on. Tyty ",{"#":"speaker_self"},"\n","^Huh ",{"#":"speaker_1"},"\n","^Why not? You going on a date?!? ",{"#":"speaker_1"},"\n","ev","str","^Why would that be so shocking?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Lol I wish","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["^ Eh no need to sound so shocked ok ",{"#":"speaker_self"},"\n","^Just because I don't report my daily movements to you doesn't mean I don't have a social life ok. ",{"#":"speaker_self"},"\n","^Wait for real? You're going on a date Anna (brother)? ",{"#":"speaker_1"},"\n","^Uh.. no. But uh, one day I will.  ",{"#":"speaker_self"},"\n","^Haha. Lemme know when you meet someone so I can warn the poor girl abt your lame jokes ",{"#":"speaker_1"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["^ Lol I wish ",{"#":"speaker_self"},"\n","^Sadly no. Not a priority right now anyway ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^I’m planning to visit a new cafe ",{"#":"speaker_self"},"\n","^You remember Marie? ",{"#":"speaker_self"},"\n","^The food girl? ",{"#":"speaker_1"},"\n","^Yeah lol ",{"#":"speaker_self"},"\n","^The food girl. I’ll tell her you called her that ",{"#":"speaker_self"},"\n","^Don’t HAHA later she will be mad at me ",{"#":"speaker_1"},"\n","^But yes what about her ",{"#":"speaker_1"},"\n","^Well she left her job at an MNC and opened up a new café ",{"#":"speaker_self"},"\n","^It’s called Resipi Alegria ",{"#":"speaker_self"},"\n","^I plan to visit her later ",{"#":"speaker_self"},"\n","^My other friends visited alr haha ",{"#":"speaker_self"},"\n","^I didn’t have time thanks to classes ",{"#":"speaker_self"},"\n","^But post-midterm week has been quite chill ",{"#":"speaker_self"},"\n","^Ohhh ",{"#":"speaker_1"},"\n","^So you’re going to be eating there? ",{"#":"speaker_1"},"\n","^Sadly no also haha ",{"#":"speaker_self"},"\n","^I’m broke rmb ",{"#":"speaker_self"},"\n","^LOL I’ll just grab a drink ",{"#":"speaker_self"},"\n","^And go home cook instant noodles I guess ",{"#":"speaker_self"},"\n","^Peak cuisine ",{"#":"speaker_self"},"\n","^Oh ok sure ",{"#":"speaker_1"},"\n","^Last call,  you sure you can’t make it tonight? ",{"#":"speaker_1"},"\n","^Pushpa Aunty is cooking fish curry ",{"#":"speaker_1"},"\n","^🥲  ",{"#":"speaker_self"},"\n","^I can’t, I only have this slot to visit her new cafe.  ",{"#":"speaker_self"},"\n",{"->":"ravi_2_2_narration"},{"#f":5}]}],{"#f":1}],"ravi_2_2_narration":[{"#":"knot:ravi_2_2_narration"},{"#":"ui:narrator"},{"#":"background:bg_ravi_cafe.jpg"},"^Finally here. Took a while to find Marie's new café.","\n","^Whoa! Sure looks fancy.","\n","^The place isn’t too packed right now. I guess 4 p.m. on a Thursday is a weird time to have coffee.","\n","^There’re not too many customers either. There’s a couple in the corner, and this reallllllly pretty girl sitting at the counter. I should definitely visit more often if this is the crowd, hehe.","\n","^Wait, no time to get distracted. Where is she... ah, there’s Marie!","\n",{"->":"ravi_2_2"},{"#f":1}],"ravi_2_2":[[{"#":"knot:ravi_2_2"},{"#":"ui:scene"},{"#":"background:bg_ravi_cafe.jpg"},{"#":"speaker_right_image:cha_ravi_marie_normal.png"},{"#":"speaker_right_name:Marie"},"^Hey! ",{"#":"speaker_self"},"\n","^Hey Ravi! What are you doing here? ",{"#":"speaker_right"},"\n","^Playing scrabble lah what you think? ",{"#":"speaker_self"},"\n","^Getting a caffeinated beverage from your fine establishment. ",{"#":"speaker_self"},"\n",{"#":"speaker_right_image:cha_ravi_marie_cheeky.png"},"^Wah, big words from the man who hasn’t turned up once since I opened! ",{"#":"speaker_right"},"\n","^Sorry la, Marie! Wish I could have come sooner. I’ve been busy. ",{"#":"speaker_self"},"\n","^With what? Chasing girls? ",{"#":"speaker_right"},"\n","^No time for girls, man. ",{"#":"speaker_self"},"\n","^You always had time for girls leh. ",{"#":"speaker_right"},"\n","^Aiyoh. I dated ONE girl for like a month when I was a teenager, and you think I’m a Romeo.  ",{"#":"speaker_self"},"\n","^Well you were always the charmer la ",{"#":"speaker_right"},"\n","^Yeah.. well.. A lot has changed since then. ",{"#":"speaker_self"},"\n","^I changed after Appa left. ",{"#":"inner_monologue"},"\n","^I wish I was still the charmer she thinks I am. ",{"#":"inner_monologue"},"\n","^I wish .... I wasn’t afraid of what a girl would see if she read too deeply into my eyes.",{"#":"inner_monologue"},"\n",{"#":"speaker_right_image:cha_ravi_marie_normal.png"},"^Haha indeed, you suddenly look more like a real adult. And you’re wearing real clothes, not baggy T-shirts everywhere  ",{"#":"speaker_right"},"\n","^Anyway, would you like a coffee? ",{"#":"speaker_right"},"\n","^Yes please! ",{"#":"speaker_self"},"\n","^Ok check out the menu, tell me what you like. It's on the house!  ",{"#":"speaker_right"},"\n","ev","str","^Iced Latte","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Chilli Coconut Agave Cafe Latte","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Oh, I’ll take an iced latte. ",{"#":"speaker_self"},"\n","^Want to try our green tea latte instead? I just added it to the menu. Trust me, it's amazing. ",{"#":"speaker_right"},"\n","^Nah, not really a fan of green tea. ",{"#":""},"\n","^First time I’ve ever heard that. Who isn’t a fan of green tea? ",{"#":"speaker_right"},"\n","^Hmm, how about our hazelnut latte? ",{"#":"speaker_right"},"\n","^Sorry, I’m allergic to hazelnuts. ",{"#":"speaker_self"},"\n","^...Seriously? ",{"#":"speaker_right"},"\n","^Yeah... ",{"#":"speaker_self"},"\n",{"#":"speaker_right_image:cha_ravi_marie_laughing.png"},"^Ok. A small, boring iced latte for a small, boring Ravi. ",{"#":"speaker_right"},"\n","^Eh, don’t like that leh... ",{"#":"speaker_self"},"\n","^Fine... one iced latte coming up. ",{"#":"speaker_right"},"\n","^Thank you! ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^  Wow. I’d like to try the ... “Chilli Coconut Agave Café Latte\"? I think… ",{"#":"speaker_self"},"\n",{"#":"speaker_right_image:cha_ravi_marie_cheeky.png"},"^Waaah. Man after my own heart. That’s my favourite. ",{"#":"speaker_right"},"\n","^Haha...really? Are you kidding me? ",{"#":"speaker_self"},"\n","^No, I’m not. I mean come on man, I made the menu. ",{"#":"speaker_right"},"\n","^Oh…it’s just that chilli coconut agave coffee doesn’t sound...that dope… ",{"#":""},"\n","^It is! Trust me on this. ",{"#":"speaker_right"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^So, have time to catch up? Since we hardly hang out nowadays, after all. ",{"#":"speaker_right"},"\n",{"#":"speaker_right_image:cha_ravi_marie_normal.png"},"^I mean, I don’t mind. But is it ok? Will your customers mind their barista just chatting at the counter? ",{"#":"speaker_self"},"\n","^Sure they won’t mind! I mean, there’s not that many people around right now. ",{"#":"speaker_right"},"\n","^The couple just want to be left alone. And that girl there is Valerie, one of my regulars. ",{"#":"speaker_right"},"\n","^Comes in nearly every afternoon. She’s probably heard a hundred of my conversations at least. I talk to her a lot too. I’m sure she won’t mind. ",{"#":"speaker_right"},"\n","^Did Marie say that her name was “Valkryie”? Weird name. Better not look at her too much. She might catch me staring. ",{"#":"inner_monologue"},"\n","^Anyway, how's everything? How's Revati? I remember meeting her for your birthday. Oh, and that biryani your mum cooked. Getting hungry just thinking about it. ",{"#":"speaker_right"},"\n",["ev",{"^->":"ravi_2_2.0.g-0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^We are ok lah... ",{"->":"$r","var":true},null]}],["ev",{"^->":"ravi_2_2.0.g-0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^Not so great ",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"ravi_2_2.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"^ Well, I mean there’s been some bumps in the road. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["ev",{"^->":"ravi_2_2.0.g-0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"^ to be honest. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^What happened? ",{"#":"speaker_right"},"\n",{"#":"speaker_right_image:cha_ravi_marie_concerned.png"},"^Mum lost her job. ",{"#":"speaker_self"},"\n","^Oh dear. ",{"#":"speaker_right"},"\n","^And we have moved out to our aunt’s place. ",{"#":"speaker_self"},"\n","^All of you? ",{"#":"speaker_right"},"\n","^Yeah. Well, I got my own place now. Just a small room. ",{"#":"speaker_self"},"\n","^That sounds...stressful. ",{"#":"speaker_right"},"\n","^It is. ",{"#":"speaker_self"},"\n","^Is your mum ok? ",{"#":"speaker_right"},"\n","^Well… she puts up a brave front for everything. ",{"#":"speaker_self"},"\n","^I feel like she doesn’t want to share her fear with us. But I can see it in her eyes. I caught her sobbing the other day. While boiling milk. ",{"#":"speaker_self"},"\n","^Asked her what’s wrong. And she was like, cutting onions for dinner. Come on! ",{"#":"speaker_self"},"\n","^Of course she doesn’t want to appear weak to her kids.  She’s been your rock. ",{"#":"speaker_right"},"\n","^Yeah. And I’m stuck between that and a hard place. ",{"#":"speaker_self"},"\n","^Hey. You got to try and think from her perspective. ",{"#":"speaker_right"},"\n","^Have you thought about how you can help out? She’s your mother, you know, with A LOT of weight on her shoulders. ",{"#":"speaker_right"},"\n","^She doesn’t want to put any of it on you. ",{"#":"speaker_right"},"\n","^I want to help out. But what can I do? Except finish my course, get my internship, get a job. ",{"#":"speaker_self"},"\n","^That will take you, like, a couple of years right? ",{"#":"speaker_right"},"\n","^Yeah. ",{"#":"speaker_self"},"\n","^How about helping her out now? Go for a walk with her. Watch a movie. Speak to her more often. Show her you’re not just mopey lil’ boring Ravi. She needs you, man.  ",{"#":"speaker_right"},"\n","^Yeah, all that is fine. But still we hardly have money to cover our meals. ",{"#":"inner_monologue"},"\n","^... ",{"#":"speaker_self"},"\n","^Hey man, what are you thinking about? ",{"#":"speaker_right"},"\n","^Earth to Ravi...? ",{"#":"speaker_right"},"\n","^... ",{"#":"speaker_self"},"\n","^Dude, don’t just live in your head. Talk to me! ",{"#":"speaker_right"},"\n","ev","str","^I should talk to Marie. Maybe she can help.","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^I can’t talk to Marie about this right now. ","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["^ Well...it’s just that I can do all that, but it won’t change our financial situation.  You know what I mean? ",{"#":"speaker_self"},"\n","^Well, I’m not saying it will. I don’t think your mum is expecting that either. But you can at least be a good son to her. ",{"#":"speaker_right"},"\n","^Sometimes just reaching out is what it takes to make the other person feel better. ",{"#":"speaker_right"},"\n","^It’d still be putting a band-aid on a fracture. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-5":["^ It’s nothing. Yeah, you’re right. ",{"#":"speaker_self"},"\n","^Come on man. What’s wrong? Tell me. ",{"#":"speaker_right"},"\n","^Hey... I can’t, not right now. ",{"#":"speaker_self"},"\n","^Why not? Aren’t we friends? We’ve known each other for so long. ",{"#":"speaker_right"},"\n","^Even if I can’t help you, I can at least be a listening ear. ",{"#":""},"\n","^Ok… It’s just that...I am just very aware of how limited my “help” is. ",{"#":"speaker_self"},"\n","^Of course, I can talk to her. Spend time with her. ",{"#":"speaker_self"},"\n","^But that won’t help our financial situation.  It’d be like putting a band-aid on a fracture. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Hmm...how about getting a proper cast? ",{"#":"speaker_right"},"\n","^What do you mean? ",{"#":"speaker_self"},"\n","^Get a job. With us. We’re looking for part-time help. I can only serve that many customers at once. ",{"#":"speaker_right"},"\n",{"#":"speaker_right_image:cha_ravi_marie_normal.png"},"^Seriously? ",{"#":"speaker_self"},"\n","^Seriously. Plus, I wouldn’t mind having more people to talk to. I’m sure Valerie’s getting tired of my rants. I could always use a new victim. Both for my rants and my coffee experiments. What do you say? ",{"#":"speaker_right"},"\n","^Oh my goodness! Yes! I would love to work here. It’ll be like the good old days. ",{"#":"speaker_self"},"\n","^Great! Can you make coffee? ",{"#":"speaker_right"},"\n","^Oh...no... ",{"#":"speaker_self"},"\n","^Honestly, I can’t even boil water right. ",{"#":"speaker_self"},"\n","^Perfect. I’ll be your teacher. Your guide to the wonderful world of baristas and brewing. You better pay attention if you want to work here! ",{"#":"speaker_right"},"\n","ev","str","^Are you taking pity on me? ","/str","/ev",{"*":".^.c-6","flg":4},["ev",{"^->":"ravi_2_2.0.g-2.37.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-7","flg":2},{"s":["^Thank you so much for this opportunity! ",{"->":"$r","var":true},null]}],{"c-6":["^ Eh you’re not just doing this to take pity on me right? ",{"#":"speaker_self"},"\n","^I run a business. I can’t afford to just be kind. I need someone I can trust behind the cash register, which is hard to find. Trust me, you’re helping me. ",{"#":"speaker_right"},"\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-7":["ev",{"^->":"ravi_2_2.0.g-2.c-7.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.37.s"},[{"#n":"$r2"}],"^ ",{"#":"speaker_self"},"\n","^I’ll be the best bistara ever! ",{"#":"speaker_self"},"\n","^Barista. And don’t thank me yet, because I might be a terrible boss.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^Thank you! ",{"#":"speaker_self"},"\n",{"#":"knot:ravi_2_minigame"},{"#":"ui:mcq"},{"#":"game_id:8"},"^Minigame 8","\n",{"->":"ravi_2_3_narration"},{"#f":5}]}],{"#f":1}],"ravi_2_3_narration":[{"#":"knot:ravi_2_3_narration"},{"#":"ui:narrator"},{"#":"background:bg_ravi_cafe.jpg"},"^It was hard work, and Marie had an even tougher job teaching me.","\n","^But after what felt like forever, I finally learnt how to make a decent cuppa.","\n","^When I got my first month’s pay, a huge weight lifted off my shoulders. It was the best feeling I had in a long while.","\n","ev",{"VAR?":"ravi_1_dormhousing"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^I could just cover my dorm room rent... and skipped enough meals to pay for Revati’s books and school supplies too.","\n",{"->":".^.^.^.16"},null]}],[{"->":".^.b"},{"b":["\n","^I could easily cover my rental costs... and even had enough left over to pay for Revati’s books and school supplies too!","\n",{"->":".^.^.^.16"},null]}],"nop","\n","^When you have money issues always hanging over your head, not having to worry about how to pay things off is the best kind of luxury. The kind you only feel once you’ve lived both scenarios.","\n","^The last 6 weeks working here have been pretty good. I get in to help with the lunch crowd and work till closing. It's pretty chill, I can get some homework done during the lull time.","\n","^At about 4 p.m., our regular patron shows up at sits at the counter right in front of me. Hmm.. she's a bit late. Maybe she isn't coming..","\n","^Oh wait. Speak of the devil.","\n",{"->":"ravi_2_3"},{"#f":1}],"ravi_2_3":[[{"#":"knot:ravi_2_3"},{"#":"ui:scene"},{"#":"background:bg_ravi_cafe2.jpg"},{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},{"#":"speaker_left_name:Val"},"^Ah, it’s you again. Running a bit late today? ",{"#":"speaker_self"},"\n","^And it’s you again. Yeah, I was. Had to finish up a painting for class. I wanted to make sure the paint was dry before I left. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_angry.png"},"^I didn’t know you had to watch paint dry in art school. ",{"#":"speaker_self"},"\n","^And I didn’t know you had to make fun of customers as a barista. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},"^Ok ok. Would you like your usual today? ",{"#":"speaker_self"},"\n","^Only if it’s as good as the last time. ",{"#":"speaker_left"},"\n","^Mmmm.... If you told me you just learnt how to make coffee a few weeks ago, I’d find it hard to believe you. ",{"#":"speaker_left"},"\n","^Well, I had a good teacher. ",{"#":"speaker_self"},"\n","^Or maybe, I was just a really good student. ",{"#":"inner_monologue"},"\n","^It’s almost like you put a secret ingredient in there or something. ",{"#":"speaker_left"},"\n","^Well... the secret ingredient is... ",{"#":"speaker_self"},"\n",["ev",{"^->":"ravi_2_3.0.40.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^...love.",{"->":"$r","var":true},null]}],"ev","str","^...honey","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["ev",{"^->":"ravi_2_3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.40.s"},[{"#n":"$r2"}],"^ ","\n","^I wish I dared to say that out loud. ",{"#":"inner_monologue"},"\n","^Imagine if I did though!",{"#":"inner_monologue"},"\n","^Not like it’ll work out. She’s just the regular here, and I’m just the barista. ",{"#":"inner_monologue"},"\n","ev",{"VAR?":"ravi_1_dormhousing"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^And if I were to taker her out on a date, Resipi Alegria is pretty much the only place I can afford because of the staff discount.  ",{"#":"inner_monologue"},"\n",{"->":".^.^.^.24"},null]}],[{"->":".^.b"},{"b":["\n","^And if I were to taker her out on a date, no way I can afford a nice restaurant - even with the savings I have on my crappy rental. Oh god, what if she finds out about my crappy rental! ",{"#":"inner_monologue"},"\n",{"->":".^.^.^.24"},null]}],"nop","\n","^What the hell am I doing thinking about taking this girl on a date. ",{"#":"inner_monologue"},"\n","^Anyway, she’s out of my league. Art classes? Regular fancy lattes? Pilates and crossfit?   ",{"#":"inner_monologue"},"\n","^This girl is smart and sophisticated, and she’s confident– the kind of confidence built from money and stability. Oh, and she’s gorgeous as hell. ",{"#":"inner_monologue"},"\n","^Seriously, I should just forget it. ",{"#":"inner_monologue"},"\n","^Nothing. I don’t add anything.   ",{"#":"speaker_self"},"\n","^Maybe I’m that good.  ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_flirt.png"},"^Oh, thank goodness! Haha... You paused so long I thought you were going to say “the secret ingredient is love” or something. ",{"#":"speaker_left"},"\n","^Wait, what?  ",{"#":"inner_monologue"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^ To be honest, Marie told me to put some honey in your coffee if you came in. She said you’d get it. I don’t know what she meant by that though but I added our best manuka honey. ",{"#":"speaker_self"},"\n","^Oh no. Now that’s a bad move. She’s gonna see that it’s Marie who understands her tastes well, and I’m just the bonehead following instructions. ",{"#":"inner_monologue"},"\n","^Argh! Why Ravi why… ",{"#":"inner_monologue"},"\n","^Ah...Marie. I really tell her too much. But it’s ok, it does taste good.  ",{"#":"speaker_left"},"\n","^Especially because you made it. ",{"#":"speaker_left"},"\n","^What did they talk about? Does Val have layered conversations like that all the time? Honey and code and insights…  ",{"#":"inner_monologue"},"\n","^Oh man, this girl so interesting, but she’s way out of my league. ",{"#":"inner_monologue"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Anyway. Mr. Barista. Care for a conversation? ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_happy.png"},"^By conversation, do you mean “complain about your day to Mr. Ravi Kannasamy”? ",{"#":"speaker_self"},"\n","^Yes. Last time I checked, that’s part of the services here at the great Resipi Alegria, no? ",{"#":"speaker_left"},"\n","^This always happens. She comes in, orders her usual, or – if she’s in an extra good mood – orders that crazy Chilli Coconut Agave Latte. ",{"#":"inner_monologue"},"\n","^We mostly talk about her day. She’s always asking me about mine, but nothing’s really new in my life... and I can’t tell her she’s the highlight.  ",{"#":"inner_monologue"},"\n","^She’s tried getting me to open up about my background. ",{"#":"inner_monologue"},"\n","^But when I get those glimpses of her interests, her family, her goals… I’d clam up on mine.  ",{"#":"inner_monologue"},"\n","^She and I are at different rungs of the social hierarchy. She’s at the top, free to pursue her passions, all her resources and provisions taken care of. I’m just trying to make it to the next day and provide for Amma and Revati. ",{"#":"inner_monologue"},"\n","^When she talks about her pursuits, I feel so impressed by her achievements. And yet, the fact that she doesn't recognise how lucky she is, being able to feed all her focus to just passion...  ",{"#":"inner_monologue"},"\n","^What if I were born well-off? Would I be as accomplished as Val?  ",{"#":"inner_monologue"},"\n","^Okay, maybe not. She probably has way more brains and talent. And looks, too. ",{"#":"inner_monologue"},"\n","^SO, I’ve been sooo busy nowadays. I’m juggling all these extra modules I’m taking, and I’m preparing a painting for that National Youth Fine Arts Competition this year. You know the one I’ve yakking about? ",{"#":"speaker_left"},"\n","^Yeah, what about it? ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},"^The first prize winner this year gets an all-expenses paid semester abroad at the University of the Arts, London! That’s one of the best art schools in the world! ",{"#":"speaker_left"},"\n","^Oh wow! Do you think you stand a chance? ",{"#":"speaker_self"},"\n","^I sure hope so. And I still have those CIP projects to handle too. I just really need sleep. And coffee. That’s why I’m here, I guess. ",{"#":"speaker_left"},"\n","^Come in more often! I’ll tell my colleagues to save your favourite seat for you. ",{"#":"speaker_self"},"\n","^That’s sweet of you, Ravi. But don’t worry. I’ll make sure to come in during your shifts. I always do. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_flirt.png"},"^So you can have yet another rant session? ",{"#":"speaker_self"},"\n","^No, so I can see you again, obviously. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_happy.png"},"^Haha.... Good one. ",{"#":"speaker_self"},"\n","^Oh man. I can’t tell if she’s just being sarcastic. ",{"#":"inner_monologue"},"\n","^So, now that you’ve heard all that I’m dealing with at the moment, can you do me a favour? ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},"^Sure. What do you want? ",{"#":"speaker_self"},"\n","^I can really do with some cheering up. ",{"#":"speaker_left"},"\n","^I’m not quite sure what would work ",{"#":"inner_monologue"},"\n","ev","str","^Play an online art quiz with her","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Tell her a lame joke","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["^ Alright. Since you love art, I wanted to challenge you to a duel!  ",{"#":"speaker_self"},"\n","^Hah! Bring it on. You don't know who you're up against. ",{"#":"speaker_left"},"\n","^It's called \"Modern Art or Toddler?\" - I'll guess first then you, ok?  ",{"#":"speaker_self"},"\n","^You don't know who you're up against. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:pixel.png"},{"#":"background:bg_ravi_art1.jpg"},"^Ok, here we go with the first question. I'll guess first. ",{"#":"speaker_self"},"\n",["ev","str","^Modern Art","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Toddler","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","ev",1,"/ev",{"VAR=":"ravi_2_modernart","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"ravi_2_modernart","re":true},{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Oh - that’s Kandinsky. ‘Black Lines.’  ",{"#":"speaker_left"},"\n","^You got it correct ","ev",{"VAR?":"ravi_2_modernart"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ and so did I",{"->":".^.^.^.10"},null]}],"nop","^! ",{"#":"speaker_self"},"\n",{"#":"background:bg_ravi_art2.jpg"},"^I guess that was easy for you. My turn again: ",{"#":"speaker_self"},"\n","ev","str","^Modern Art","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Toddler","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["\n","ev",{"VAR?":"ravi_2_modernart"},1,"+",{"VAR=":"ravi_2_modernart","re":true},"/ev",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^It’s a Joan Mitchell.  ",{"#":"speaker_left"},"\n","^Woah! Right again. Someone's been studying eh? ",{"#":"speaker_self"},"\n",{"#":"background:bg_ravi_art3.jpg"},"^Ok, last question.  ",{"#":"speaker_self"},"\n","ev","str","^Modern Art","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Toddler","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["\n","ev",{"VAR?":"ravi_2_modernart"},1,"+",{"VAR=":"ravi_2_modernart","re":true},"/ev",{"->":".^.^.^.g-2"},{"#f":5}],"c-5":["\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Hmm. Looks like a de Kooning, but then I don’t think it is…  Well, it’s not done by a kid, for sure. I'll go with Modern Art. ",{"#":"speaker_left"},"\n","^Full marks, wooh!  ",{"#":"speaker_self"},"\n","ev",{"VAR?":"ravi_2_modernart"},3,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^I managed to get them all right too - including that last lucky guess! The last one is modern art... but with a twist! ",{"#":"speaker_self"},"\n",{"->":".^.^.^.13"},null]}],[{"->":".^.b"},{"b":["\n","^Looks like your knowledge of art is better than mine! Ok that should go without saying. The last one is modern art... but with a twist! ",{"#":"speaker_self"},"\n",{"->":".^.^.^.13"},null]}],"nop","\n","^Who’s it by? ",{"#":"speaker_left"},"\n","^Believe it or not, it’s by a chimp. Congo the chimpanzee. Circa 1957. ",{"#":"speaker_self"},"\n","^HAHAHAHAHA! No shit! An actual monkey? ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_incredulous.png"},{"#":"background:bg_ravi_cafe2.jpg"},"^Yeah. So ridiculous!  Apparently this sold for like a zillion dollars. Now I need to re-evaluate my life choices. Maybe I should quit being a barista and train some monkeys to do art. ",{"#":"speaker_self"},"\n","^Well please don't quit, because otherwise I wouldn't get to hang out with my favourite Mr Barista every day. Plus if you were a zillionaire you might not have time for me. ",{"#":"speaker_left"},"\n",{"->":"ravi_2_3.0.g-1"},{"#f":5}]}],{"#f":5}],"c-3":["\n","^Well, I’m not much of a comedian. But maybe I can tell you a joke? ",{"#":"speaker_self"},"\n","^Sure, humour me. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_incredulous.png"},"^So...Why did the coffee file a police report? ",{"#":"speaker_self"},"\n","^Because it was mugged! ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},"^Ah, if I’m going to be honest, that joke feels a bit lukewarm. ",{"#":"speaker_left"},"\n","^Not good enough? Hmm, how about this one. ",{"#":"speaker_self"},"\n","^“A girl walks into Resipi Alegria, and orders a coffee to go. ",{"#":"speaker_self"},"\n","^The coffee gets up and leaves”. ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_happy.png"},"^Haha... Is the girl supposed to be me? Who’s the coffee? You? ",{"#":"speaker_left"},"\n","^Haha... I don’t know! I just added you in for the joke. ",{"#":"speaker_self"},"\n","^Don’t worry. I’ll always come in, but I’ll never ask you to leave. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_flirt.png"},{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^Wow. From the way she smooth-talks, you’d think she actually likes me. ",{"#":"inner_monologue"},"\n","^I guess a guy can dream. ",{"#":"inner_monologue"},"\n","^Well, anyway, it’s late. I need to go soon. Thanks for today, Ravi. I really needed it. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},"^Could I have a Chilli Coconut Agave Café Latte to go please? ",{"#":"speaker_left"},"\n","^Make sure you spell my full name right this time, not just Val or The Regular. ",{"#":"speaker_left"},"\n","^Uh, I’m sorry about that. ",{"#":"speaker_self"},"\n","^Valkyrie is a weird name, but I’m quite certain I spelt it correctly... ",{"#":"inner_monologue"},"\n","^Just so we’re clear, the name’s Valerie, not Valkyrie. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_flirt.png"},"^OH MY GOD. This whole time I thought you were named Valkyrie. ",{"#":"speaker_self"},"\n","^(laughs) Because of my tattoo? Call me judgy but I’ll never ink my own name on my arm. Too basic. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_happy.png"},"^Aren’t Valkyries like great warriors or angels or something? It fits you. OK Valerie does, too. ",{"#":"speaker_self"},"\n","^Just to make sure you don’t mess it up again, I’ll spell it out for you this time so you'll never forget it. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_flirt.png"},"^Is that your phone over there? ",{"#":"speaker_left"},"\n","^Yeah, why- ",{"#":"speaker_self"},"\n","^(GRABS RAVI’S PHONE) ",{"#":"speaker_left"},"\n","^Hey! What are you doing? ",{"#":"speaker_self"},"\n","^(typing) It’s V A L E R I E ",{"#":"speaker_left"},"\n","^Right, right. Got it. Could I please have my phone back? ",{"#":"speaker_self"},"\n",{"#":"background:bg_ravi_valnumber.jpg"},"^And my number is 8161427. Saved. ",{"#":"speaker_left"},"\n","^Got it. Wait..what? ",{"#":"speaker_self"},"\n",{"#":"background:bg_ravi_cafe2.jpg"},"^I really have to go right now. But make sure you call me tonight, okay, Ravi? I have something I really want to say to you. See you around. ",{"#":"speaker_left"},"\n","^Wow. Uh...I’ll call you, Valkyrie. I mean, Valerie. See you. ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:pixel.png"},"^Great, I came off like a total idiot. I must be the only person who got her name wrong. ",{"#":"inner_monologue"},"\n","^What does she see in someone like me? Does she see Mr. Barista, or plain old Ravi? ",{"#":"inner_monologue"},"\n","^Oh wait, she doesn’t know plain old Ravi, and that’s my own fault. ",{"#":"inner_monologue"},"\n","ev",{"VAR?":"ravi_1_dormhousing"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^Once she finds out I live in a tiny dorm room, or that I can’t afford to buy her a coffee let alone a nice meal, or that my family situation is so messed up… sigh. ",{"#":"inner_monologue"},"\n",{"->":".^.^.^.89"},null]}],[{"->":".^.b"},{"b":["\n","^Once she finds out I live in a rented bedroom that looks like a dungeon, or that I can’t afford to buy her a nice meal, or that my family situation is so messed up… sigh. ",{"#":"inner_monologue"},"\n",{"->":".^.^.^.89"},null]}],"nop","\n",{"->":"ravi_2_4_narration"},{"#f":5}]}],{"#f":1}],"ravi_2_4_narration":[[{"#":"knot:ravi_2_4_narration"},{"#":"ui:narrator"},{"#":"background:bg_ravi_bedroom.jpg"},"^I’ve been thinking about it the whole day, and I still don’t get why Val was flirting with me.","\n",{"#":"background:bg_ravi_valnumber.jpg"},"^She’s made it so easy, giving me just one job to do. I just have to call her. And yet I'm so nervous.","\n","ev","str","^Call Val","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Don't call Val","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"ravi_2_4_call"},"\n",{"#f":5}],"c-1":["^ ",{"->":"ravi_2_4_nocall"},"\n",{"#f":5}]}],{"#f":1}],"ravi_2_4_call":[{"#":"knot:ravi_2_4_call"},{"#":"ui:narrator"},{"#":"background:bg_ravi_valnumber.jpg"},"^Should I call her? Maybe I should!","\n","^But what if she doesn't actually like me?  I don’t want to risk losing her as a friend.","\n","^If I don't call her, I wouldn’t need to bring her over to Pushpa Aunty’s place to meet my family. And I wouldn’t need to meet hers.","\n","^That way, I won’t risk disappointing both of us.","\n","^But not knowing if we will work out – I’ll regret it for the rest of my life.","\n",{"->":"chapter_2_ending_1"},{"#f":1}],"ravi_2_4_nocall":[{"#":"knot:ravi_2_4_mpcall"},{"#":"ui:narrator"},{"#":"background:bg_ravi_valnumber.jpg"},"^Should I call her? Sigh. So many questions in my head.","\n","^That was a bold, smooth move she made. Maybe because she was just bored. Or because I was just an easy target to practice her flirting game.","\n","^Or because flirting with the barista is fun when you’ve yet to work out why he’s even a barista.","\n",{"#":"ui:notification"},{"#":"background:ui_ravi_message.jpg"},"^Marie: Heyo! ",{"#":"message"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_bedroom.jpg"},"^Ah, my dear boss lady. Looks like I’m gonna have more shifts.","\n",{"#":"ui:notification"},{"#":"background:ui_ravi_message.jpg"},"^Marie: No new shifts yet but got you sth better. Val dmed me for your no. And I gave it to her;) ",{"#":"message"},"\n",{"#":"ui:notification"},{"#":"background:ui_ravi_phonecall.jpg"},"^VALERIE ",{"#":"message"},"\n",{"#":"ui:narrator"},{"#":"background:bg_ravi_bedroom.jpg"},"^Wow. Wowww. She’s a Valkyrie alright. She takes what she wants.","\n","^But... Our friendship is too much to lose. Better to keep what we have now than risk us not working out.","\n","^Even if Val still accepts me after knowing about my family and our situation, her parents won’t. I’m broke, I’m neighbourhood-schooled, and – oh! Cherry on the cake – I’m Indian.","\n","^I should know how it is with the Chinese majority. I can't even rent a flat from them - how would they feel if I were to date their daughter?","\n","^And ...I like Val too much to rock her boat.","\n","^I think it’s best NOT to pick up this call.","\n","^What’s that French phrase she taught me?","\n",{"->":"chapter_2_ending_2"},{"#f":1}],"chapter_2_ending_1":[{"#":"knot:chapter_2_ending_1"},{"#":"ui:narrator"},{"#":"background:bg_ravi_valnumber.jpg"},"^There’s that phrase Val taught me. Carpe diem - seize the day.","\n","ev",1,"/ev",{"VAR=":"chapter_2_ending","re":true},"^If there’s a time for it, it’s now. Right. Here it goes, no regrets...","\n",{"->":"ravi_2_reflection"},{"#f":1}],"chapter_2_ending_2":[{"#":"knot:chapter_2_ending_1"},{"#":"ui:narrator"},{"#":"background:bg_ravi_bedroom.jpg"},"^C’est la vie. That’s life. It’s painful, it’s unfair.","\n","ev",2,"/ev",{"VAR=":"chapter_2_ending","re":true},"^It’s what it is. Sorry, Val.","\n",{"->":"ravi_2_reflection"},{"#f":1}],"ravi_2_reflection":[{"#":"knot:ravi_2_reflection"},{"#":"ui:chapter_reflection"},{"#":"reflection_id:8"},"^Reflection 8","\n",{"->":"ravi_3_intro"},{"#f":1}],"ravi_3_intro":[{"#":"knot:ravi_3_intro"},{"#":"ui:narrator"},{"#":"background:bg_ravi_bedroom.jpg"},"ev",{"VAR?":"chapter_2_ending"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^So, the impossible happened: Val and I got together. I am still in shock - how can a girl like that be with a guy like me?!","\n","^That’s the first great change in my life.","\n","^The second change is - I’ve landed an engineering internship! Not only will I fulfil my semester credits, I’m gonna get a taste of office life!","\n","^It feels like I’ve won the lottery twice. I’m excited, but now I’m also feeling anxious for my first day tomorrow.","\n",{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["\n","^So, what happened for Val and me? The impossible.","\n","^After I decided not to answer her call, she strode into the cafe the next day and told me if I wasn’t going to take the next step, I’d need to give her an honest reason why.","\n","^Before I could answer, she asked me if I liked her. Point-blank.","\n","^Of course I said yes. Then she looked me square in the eye and said I’d better prove it with a date.","\n","^So, uh, we’re together now. I still can't believe it. That’s the first great change in my life.","\n","^The second change is - I’ve landed an engineering internship! Not only will I fulfil my semester credits, I’m gonna get a taste of office life!","\n","^It feels like I’ve won the lottery twice. I’m excited, but now I’m also feeling anxious for my first day tomorrow.","\n",{"->":".^.^.^.10"},null]}],"nop","\n","ev",2,"/ev",{"VAR=":"chapter_id","re":true},{"#":"background:black.jpg"},"^CHAPTER ","ev",{"VAR?":"chapter_id"},"out","/ev","^ ",{"#":"title"},"\n","^The Internship ",{"#":"title"},"\n",{"->":"ravi_3_1"},{"#f":1}],"ravi_3_1":[[{"#":"knot:ravi_2_1_narration"},{"#":"ui:whatsapp"},{"#":"background:bg_ravi_bedroom.jpg"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Family"},{"#":"chat_group_image:ico_ravi_family.png"},{"#":"speaker_1_name:Revati"},{"#":"speaker_2_name:Amma"},{"#":"timestamp:21.31"},"^Earlier before you left you said you had something on today? ",{"#":"speaker_2"},"\n","^Didn’t hear you properly. Next time don’t speak when you eat. ",{"#":"speaker_2"},"\n","^Anna said he was going to start his uni internship tomorrow ",{"#":"speaker_1"},"\n","^Yes haha ",{"#":"speaker_self"},"\n","^I needed an internship to fulfil my university credits ",{"#":"speaker_self"},"\n","^And I’ve been applying for a while ",{"#":"speaker_self"},"\n","^Wow! Good that you managed to find one. ",{"#":"speaker_2"},"\n","^Did your boss at the café give you any trouble? ",{"#":"speaker_2"},"\n","ev","str","^She's very understanding","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I just manage my time well","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Marie? No, she’s very understanding ",{"#":"speaker_self"},"\n","^We’re friends after all ",{"#":"speaker_self"},"\n","^She gave me time to prepare for interviews and make my internship applications ",{"#":"speaker_self"},"\n","^I don’t think I would have got the internship if not for her actually ",{"#":"speaker_self"},"\n","^Can you do anything on your own? ",{"#":"speaker_1"},"\n","^🙄 ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^ I squeezed out time for interviews and applications somehow  ",{"#":"speaker_self"},"\n","^I suspect Marie let you have lots of flexibility Anna ",{"#":"speaker_1"},"\n","^Well, to tell the truth, she was quite nice la. We're friends after all. ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Anyway the internship starts tomorrow ",{"#":"speaker_self"},"\n","^It’s going to be for 3 months ",{"#":"speaker_self"},"\n","^I hope I don't mess it up ",{"#":"speaker_self"},"\n","^Don’t worry kanna. ",{"#":"speaker_2"},"\n","^I know you can do it. ",{"#":"speaker_2"},"\n","^You’ve been very responsible recently. ",{"#":"speaker_2"},"\n","^You are a man now! ",{"#":"speaker_2"},"\n","^Only in Amma's eyes... 😂  ",{"#":"speaker_1"},"\n","^HAHAHA ",{"#":"speaker_self"},"\n","^Thank you Amma and thangachi (sister) ",{"#":"speaker_self"},"\n","^Wish me luck! ",{"#":"speaker_self"},"\n",{"->":"ravi_3_2"},{"#f":5}]}],{"#f":1}],"ravi_3_2":[[{"#":"knot:ravi_3_2"},{"#":"ui:narrator"},{"#":"background:bg_ravi_meetingroom.jpg"},"^8.20 a.m. Turbine Engineering Pte Ltd Aerospace Meeting Room 3.","\n","^It’s Day One of the internship.","\n",{"#":"ui:scene"},{"#":"background:bg_ravi_meetingroom.jpg"},{"#":"speaker_left_image:cha_ravi_roger_normal.png"},{"#":"speaker_left_name:Roger"},{"#":"speaker_right_image:cha_ravi_qian_normal.png"},{"#":"speaker_right_name:Qi An"},"^This is it. Ok, Ravi. You've got this. ",{"#":"inner_monologue"},"\n","^“Ravi Kannasamy, engineering intern.” So this is what adulting sounds like. Neat.  ",{"#":"inner_monologue"},"\n","^God, I’m so nervous. I’m wearing my lucky socks but they’re not helping. But of course. Socks aren’t lucky.  ",{"#":"inner_monologue"},"\n","^Right. Ok. I’m good art what I do. And I’m doing it for Amma. And Revu. Shoot my hands are shaking.","\n",{"#":"inner_monologue"},"^The email said to report at 830. Maybe I shouldn’t have come so early. ",{"#":"inner_monologue"},"\n","^Oh my god, there are people who came earlier than me! Hopefully I can make some friends. ",{"#":"inner_monologue"},"\n","^I’m like the only Indian here.   ",{"#":"inner_monologue"},"\n","^There’s somebody they’re all talking to. He looks important. Oh boy, here we go. I’m really feeling it now. ",{"#":"inner_monologue"},"\n","^Hello everyone. Good Morning. Welcome to Turbine Engineering Pte Ltd for your internship programme. You will be able to learn much more about aviation engineering in the next few weeks. ",{"#":"speaker_left"},"\n","^...Quite sunny today ah? Sorry ah, I’m not very good at this kind of corporate introduction. ",{"#":"speaker_left"},"\n","^So how’s everyone doing? ",{"#":"speaker_left"},"\n","^Nobody wants to speak...I guess they’re as nervous as I am, too. ",{"#":"inner_monologue"},"\n",{"#":"speaker_right_image:cha_ravi_marcus_normal.png"},{"#":"speaker_right_name:Marcus"},"^...Good, sir. How are you sir? ",{"#":"speaker_right"},"\n","^Wow, this Marcus fella. So formal. Makes me feel like I’m back in NS again. ",{"#":"inner_monologue"},"\n","^Good. Good. What’s your name again? ",{"#":"speaker_left"},"\n","^Marcus Mak sir. M.A.R.C.U.S space M.A.K. I answer to Marcus. ",{"#":"speaker_right"},"\n","^Wow maybe he’s not just formal, he’s a complete robot! ",{"#":"inner_monologue"},"\n","^Ok, and what about you? ",{"#":"speaker_left"},"\n",["^oh, me?? Hello! ",{"#":"speaker_self"},"\n","^Yes, hello. What’s your name? ",{"#":"speaker_left"},"\n","^Ravi. ",{"#":"speaker_self"},"\n","^Oh good, easy name ah. ",{"#":"speaker_left"},"\n","^Haha, yes. ",{"#":"speaker_self"},"\n","^Ravi what ah? ",{"#":"speaker_left"},"\n","^Kannasamy. Ravi Kannasamy. ",{"#":"speaker_self"},"\n","^Kandaswamy ah? ",{"#":"speaker_left"},"\n","ev","str","^Correct him","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ignore it","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ Kannasamy. With two Ns. ",{"#":"speaker_self"},"\n","^Oh ok. Ravi KandasaNNy right? Better I just call you just Ravi haha! Anyway, I’m Roger. ",{"#":"speaker_left"},"\n","^Uh ",{"#":"speaker_self"},"\n","^It’s Kannasamy... but I think I better not push this otherwise I might upset him on my first day. Anyway it’s not a big deal. ",{"#":"inner_monologue"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-1":["^ Sigh. It’s Kannasamy... It's not even that hard. ",{"#":"inner_monologue"},"\n","^But I think I better not push this otherwise I might upset him on my first day. Anyway it’s not a big deal. ",{"#":"inner_monologue"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5,"#n":"g-0"}],{"g-1":["^I’ll be your supervisor. You will be rotated around different teams, but you’ll start with the Systems Team first, focusing on AI integration, which is my team.  ",{"#":"speaker_left"},"\n","^I’ll brief you all about this team and the other teams later. ",{"#":"speaker_left"},"\n","^HR has already set up your emails and assigned you computers. All of you will be seated in the interns' room.  ",{"#":"speaker_left"},"\n","^You will have an Orientation Booklet placed at your desks. Read it ah, it should give you all the info you’ll need. ",{"#":"speaker_left"},"\n","^Thank you, sir. ",{"#":"speaker_right"},"\n",{"#":"speaker_right_image:cha_ravi_qian_normal.png"},{"#":"speaker_right_name:Qi An"},"^Thank you.",{"#":"speaker_right"},"\n","^Ok, follow me. I’ll bring you to my colleague who’s giving the tour. She’ll also give you your passes  to enter the office. ",{"#":"speaker_left"},"\n","^[In Chinese] lkvki wthzc yalao snidl jdyos mljhq pwvpc zgcgi wfyku vufui lkvki wthzc yalao snidl jdyos mljhq pwvpc zgcgi wfyku vufuilkvki wthzc yalao snidl jdyos mljhq pwvpc zgcgi wfyku vufui ",{"#":"speaker_left"},"\n","^Oh sorry Ravi, there’s a welcome lunch. Dim sum. You eat right? ",{"#":"speaker_left"},"\n","^Yes I do! ",{"#":"speaker_self"},"\n","^[In Chinese] lwnbq ysnmu dwaec uytaj bvixn qlhcg wbhxz lnbtp rfbbr  12:30 ok? ",{"#":"speaker_left"},"\n","^Sure! ",{"#":"speaker_right"},"\n",{"#":"speaker_right_image:cha_ravi_marcus_normal.png"},{"#":"speaker_right_name:Marcus"},"^Yes, sir.",{"#":"speaker_right"},"\n","^Wait what? What did he say? Is it ok to ask? Crap. ",{"#":"inner_monologue"},"\n","ev","str","^Ask Roger directly","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Don't ask him","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["^ Excuse me, Roger? Sorry, I didn’t quite get that. ",{"#":"speaker_self"},"\n","^Ah, sorry. Lunch is at 1230. Meet me downstairs later if you’re coming. ",{"#":"speaker_left"},"\n","^Ok, thank you! ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-3":["^ Hmm… hope it isn’t anything important. I'll figure it out later. ",{"#":"inner_monologue"},"\n","^Yes!  ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_qian_normal.png"},{"#":"speaker_left_name:Qi An"},"^Eh sorry ah guys, what did he say at the end?  ",{"#":"speaker_self"},"\n","^Weren’t you listening? You should always pay respect to your seniors and superiors.  ",{"#":"speaker_right"},"\n","^I mean, I WAS listening...he said something in Chinese, didn’t he？ ",{"#":"speaker_self"},"\n","^Oh! Yeah, he said lunch was at 12.30. We can meet him downstairs later. ",{"#":"speaker_left"},"\n","^Ok, thank you! ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^I know Roger didn’t mean any harm, but couldn’t he have just told all of us the same thing at the same time? He probably just didn’t think it through.  ",{"#":"inner_monologue"},"\n","^Anyway. Let me go get my pass! Can’t wait to get started. I want to see how the rest of the office looks like. ",{"#":"inner_monologue"},"\n","^So, Qi An and...Marcus, right? ",{"#":"speaker_self"},"\n","^Affirmative. ",{"#":"speaker_right"},"\n",{"#":"speaker_left_image:cha_ravi_qian_normal.png"},{"#":"speaker_left_name:Qi An"},"^Yup! ",{"#":"speaker_left"},"\n","^Crazy huh, first day? ",{"#":"speaker_self"},"\n","^Yeah. Let’s talk at lunch later. I’m going to meet my uncle first. ",{"#":"speaker_left"},"\n","^He works here? ",{"#":"speaker_self"},"\n","^Yeah. He’s the CEO. ",{"#":"speaker_left"},"\n","^Oh wow. That’s cool! ",{"#":"speaker_self"},"\n","^Yeah, Marcus, let’s go, I’ll introduce you to him. See you later Ravi. ",{"#":"speaker_left"},"\n","^Let us move. ",{"#":"speaker_right"},"\n","^Ok! uh ... see you later guys ",{"#":"speaker_self"},"\n","^Wait, why wasn’t I invited? Did they know each other before this internship? They did seem quite chummy earlier when they were talking to Roger jus- ",{"#":"inner_monologue"},"\n","^(turns and bangs into glass door) OWWW! ",{"#":"speaker_self"},"\n","^Wah. Are you alright? ",{"#":"speaker_left"},"\n","^Owww... Yeah I’m ok. Just a small bruise on my forehead. ",{"#":"speaker_self"},"\n","^Wow. Really a crazy first day for you. Keep your eyes open, bro. ",{"#":"speaker_left"},"\n","^Affirmative. It’s best to see where you are going. You reduce clumsiness that way. ",{"#":"speaker_right"},"\n","^Haha, yeah... so embarrassing. ",{"#":"speaker_self"},"\n","^Marcus, let’s go. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:pixel.png"},{"#":"speaker_right_image:pixel.png"},"^Why am I so unlucky today? Must be the nerves.  ",{"#":"inner_monologue"},"\n","^Just put your head down and work, Ravi. Keep your head up and walk. And keep your eyes open. ",{"#":"inner_monologue"},"\n",{"->":"ravi_3_3"},{"#f":5}]}],{"#f":1}],"ravi_3_3":[[{"#":"knot:ravi_3_3"},{"#":"ui:narrator"},{"#":"background:bg_ravi_cafeteria.jpg"},"^And just like that, a week passed. My internship is going ok, if I do say so myself! I got my hands on the machinery and equipment they used, and learned a lot more than in uni.","\n","^There's one thing that bugs me - I can’t seem to make friends. The interns share the same room, but we hardly talk. Doesn’t help that Marcus is so robotic and Qi An is so aloof. And they usually chat in Chinese.","\n","^Well, there's also another thing that bugs me. I think Qi An and Marcus made some comments about me when they were chatting. I don’t want to confront them, but what they said really hurt me.","\n","^I know they think it’s funny, but it’s not. I mean, I’ve had my fair share of such comments before. But come on, we’re already in uni. It’s time to grow up.","\n","^With all that's happened, I'm glad that it's lunch now.","\n",{"#":"ui:scene"},{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},{"#":"speaker_left_name:Val"},"^Hmm...what should I get for lunch today- ",{"#":"inner_monologue"},"\n","^Hi!!!! ",{"#":"speaker_left"},"\n","^WOAH! You scared me. ",{"#":"speaker_self"},"\n","^Wait a minute, how did you even get in? How did you get past security? ",{"#":""},"\n","^I have my tricks. ",{"#":"speaker_left"},"\n","^Seriously... ",{"#":"speaker_self"},"\n","^I’m really thankful for Val. She’s really cheery once you get to know her. And headstrong, too. She kind of inspires me whenever I feel overwhelmed by work. ",{"#":"inner_monologue"},"\n","^Not that everything was smooth-sailing when we first got together though... ",{"#":"inner_monologue"},"\n","^I told them I’ve come to meet the great Mr. Ravi Kannasamy. And they said, “Yes ma’am, of course, this way please.” ",{"#":"speaker_left"},"\n","^Val...seriously! ",{"#":"speaker_self"},"\n","^Why are you so worked up! I’m here to see you. ",{"#":"speaker_left"},"\n","^No, but they shouldn’t have let you in! You need a pass. ",{"#":"speaker_self"},"\n","^Wow. Someone’s wound up. I spoke to the security guard and he said I could wait until you came out. And then I kinda just slowly shuffled over into the reception area. He seemed too engrossed on his phone. And now I’m here. ",{"#":"speaker_left"},"\n","^Could you not do things like this please? I work here, if you don’t realise. You can’t just waltz in like this. ",{"#":"speaker_self"},"\n","^Ok I’m sorry, no waltzing. I’ll let you know when I’m coming next time. ",{"#":"speaker_left"},"\n","^Thank you. ",{"#":"speaker_self"},"\n","^I’m starving. What's good here? ",{"#":"speaker_left"},"\n","^Oh - the canteen is already full. ",{"#":"speaker_self"},"\n","^No it’s not, I see a couple of seats over there! There’s two seats left. We can ask to share. ",{"#":"speaker_left"},"\n",{"#":"speaker_right_image:cha_ravi_marcus_qian.png"},{"#":"speaker_right_name:Marcus & Qi An"},"^Wait a minute, no! Don’t do that! ",{"#":"speaker_self"},"\n","^What’s wrong? ",{"#":"speaker_left"},"\n","^Those people are my colleagues. ",{"#":"speaker_self"},"\n","^So? ",{"#":"speaker_left"},"\n","^So, I don’t want to sit with them. ",{"#":"speaker_self"},"\n","^Why can’t we just go sit with them? ",{"#":"speaker_left"},"\n","^Because … I don’t want to. ",{"#":"speaker_self"},"\n","^Then why don’t we go somewhere else? ",{"#":"speaker_left"},"\n","^I have to be back in the office at 1 sharp. We have a meeting. ",{"#":"speaker_self"},"\n","^You’re acting really weird, you know that? ",{"#":"speaker_left"},"\n","^I’m sorry. Is it weird of me to want to do something? It’s not too much of me to ask to not to do something I don’t want to do, is it? I just don’t want to sit with them. That’s it. ",{"#":"speaker_self"},"\n","^Ok, I am leaving. I’m not sure what’s wrong with you today, but I’m not dealing with it. ",{"#":"speaker_left"},"\n","^No... wait. ",{"#":"speaker_self"},"\n","^Ravi, I come down all the way to have lunch with you. And you’re behaving like a kid. If you don't tell me what's wrong, there's no point in me staying. ",{"#":"speaker_left"},"\n","^Please don’t make a scene. ",{"#":"speaker_self"},"\n","^I’m the one making a scene? You don’t even have the guts to go sit at a table with your colleagues. And you’re blaming me? Goodbye. You can call me when the real Ravi is back. ",{"#":"speaker_left"},"\n","^It’s because of me, isn’t it? ",{"#":"speaker_left"},"\n","^No, no, why would it be because of you? ",{"#":"speaker_self"},"\n","^I don’t know either! Is it my dress sense? Or the fact that you don’t want your engineer friends to know you’re dating a girl in arts school? What’s wrong with the arts? ",{"#":"speaker_left"},"\n","^No, no, Val, it’s not that...it’s- ",{"#":"speaker_self"},"\n","^What is it then? Tell me.  ",{"#":"speaker_left"},"\n","^I won’t make a scene or raise my voice, but Ravi, please, talk to me. Why can’t we sit with them? Would you rather go somewhere else to eat? ",{"#":"speaker_left"},"\n","^I can’t tell her why it’d be a bad idea to sit with them. I know it would upset her. They’ve made so many mean comments at work. Racist and sexist jokes, too. ",{"#":"inner_monologue"},"\n","^I don’t know what they’d say if they found out we were dating. They’d probably make fun of Valerie too, even if they don’t think it’s hurtful... ",{"#":"inner_monologue"},"\n","ev","str","^Play it cool with her","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Tell her the truth","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"ravi_3_3a"},"\n",{"#f":5}],"c-1":["^ ",{"->":"ravi_3_3b"},"\n",{"#f":5}]}],{"#f":1}],"ravi_3_3a":[{"#":"knot:ravi_3_3a"},{"#":"ui:scene"},{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},{"#":"speaker_left_name:Val"},{"#":"speaker_right_image:cha_ravi_marcus_gossipy.png"},{"#":"speaker_right_name:Marcus"},"^Ok, you know what. It’s ok. Let’s just wait for a while. I’m sure we can find seats here. ",{"#":"speaker_self"},"\n","^You sure? I don’t know what’s wrong with your colleagues, but I can just go too if today isn’t a good time for lunch. We can always eat another day. ",{"#":"speaker_left"},"\n","^It’s ok. I’m sure someone will leave soon. Let’s just wait here. ",{"#":"speaker_self"},"\n","^[Marcus whispers something to Qi An] ",{"#":"speaker_right"},"\n",{"#":"speaker_right_image:cha_ravi_qian_gossipy.png"},{"#":"speaker_right_name:Qi An"},"^[Qi An whispers back]  ",{"#":"speaker_right"},"\n",{"#":"speaker_right_image:pixel.png"},"^Hey Ravi, are you feeling alright? You’re sweating like crazy all of a sudden. Here, take a tissue. ",{"#":"speaker_left"},"\n","^...thank you. On second thought, let’s go elsewhere. ",{"#":"speaker_self"},"\n","^Did they spot us? I saw them whispering to each other. I hope not. ",{"#":"inner_monologue"},"\n","^Ok, now that we’ve left, please tell me what’s going on. Did something happen with those guys? ",{"#":"speaker_left"},"\n","^Nothing. I just don’t want to make a scene here. Let’s just grab lunch at the WagDonald’s. The queue is probably shorter too. ",{"#":"speaker_self"},"\n","^I can’t tell her. How do I tell her how toxic those two are. I don’t feel like I belong here. And I don’t see this changing any time soon. They make me feel so small. I know they don’t like me. Or even understand me. Sigh.  ",{"#":"inner_monologue"},"\n",{"->":"ravi_3_4"},{"#f":1}],"ravi_3_3b":[{"#":"knot:ravi_3_3b"},{"#":"ui:scene"},{"#":"speaker_left_image:cha_ravi_valerie_normal.png"},{"#":"speaker_left_name:Val"},{"#":"speaker_right_image:cha_ravi_marcus_qian.png"},{"#":"speaker_right_name:Marcus & Qi An"},"^Well, they’re not very nice people, to be honest. ",{"#":"speaker_self"},"\n","^What do you mean? ",{"#":"speaker_left"},"\n","^I have been working here for a month. And the only time they have said anything remotely friendly to me has been NEVER. I just shut up and do what I’m told. When I can understand it. ",{"#":"speaker_self"},"\n","^What do you mean, “When you understand it”? ",{"#":"speaker_left"},"\n","^Val, they just talk all the time with each other -- and mostly in Chinese. I miss meeting times because they just make their own plans and don’t tell me when they change. I just do my reports and shut up. Just hear them laugh at their stupid jokes. ",{"#":"speaker_self"},"\n","^AAAH. I’m so FRUSTRATED! Sometimes I wish I NEVER took this internship. ",{"#":"speaker_self"},"\n","^Where did that come from? This is not me. I miss Amma. And I miss Revu. I haven’t even seen them this week. And I’m being very rude to Valerie. My hands are shaking. ",{"#":"inner_monologue"},"\n","^Ravi, I don’t know what they did to you, but you’ve wanted this internship forever. ",{"#":"speaker_left"},"\n","^And what do you mean by stupid jokes? ",{"#":"speaker_left"},"\n","^You know how guys are. They make jokes about me. Not about something like my appetite. You know what they joke about. And they’ve made jokes about some of our female colleagues too. They act like nobody can hear them. I can’t take it. ",{"#":"speaker_self"},"\n","^Wow...thanks for being honest, Ravi. I never knew anything about this. ",{"#":"speaker_left"},"\n","^Sorry, Val...I just didn’t tell you because I knew it would upset you. I thought I could deal with it by myself. ",{"#":"speaker_self"},"\n","^Thank goodness we didn’t sit with them then. If not the only thing they’ll be eating for lunch is my knuckle sandwich. ",{"#":"speaker_left"},"\n","^Speaking of sandwich, we can go to Metros nearby for lunch. They're giving away free cookies - sugar always cheers you up. ",{"#":"speaker_left"},"\n","^Oh, Val, you know how to make me happy. ",{"#":"speaker_self"},"\n",{"->":"ravi_3_4"},{"#f":1}],"ravi_3_4":[[{"#":"knot:ravi_3_4"},{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Interns @ Turbine Engineering"},{"#":"chat_group_image:ico_ravi_turbine.png"},{"#":"speaker_1_name:Qi An"},{"#":"speaker_2_name:Marcus"},{"#":"speaker_3_name:Roger"},{"#":"timestamp:16.27"},"^Hey, you finish work alr? I downstairs ",{"#":"speaker_1"},"\n","^Is he asking me? Can’t be right? ",{"#":"inner_monologue"},"\n","^Negative. T-minus 30 minutes. My tasks will be complete by then. ",{"#":"speaker_2"},"\n","^😤 😤 😤 ",{"#":"speaker_1"},"\n","^Faster leh. I want to go catch happy hour! ",{"#":"speaker_1"},"\n","^Noted with thanks. I’ll expedite my work. ",{"#":"speaker_2"},"\n","^Faster ok! ",{"#":"speaker_1"},"\n","^Anyway, what are your thoughts? ",{"#":"speaker_1"},"\n","^Thoughts? On what? ",{"#":"speaker_2"},"\n","^You know, what do you think? About...that ",{"#":"speaker_1"},"\n","^I am confused. Please elaborate. ",{"#":"speaker_2"},"\n","^Ravi and that girl he was fighting with in the canteen. You didn’t see ah? ",{"#":"speaker_1"},"\n","^They really don’t realise I’m on this chat... ",{"#":"inner_monologue"},"\n","^Negative. I was too focused on my chicken beryani ",{"#":"speaker_2"},"\n","^Well, I think it’s his gf leh ",{"#":"speaker_1"},"\n","^Ravi can get a girlfriend? He seems so robotic. ",{"#":"speaker_2"},"\n","^No offence, but has he looked in a mirror? ",{"#":"inner_monologue"},"\n","^I also say. Chinese girl some more. ",{"#":"speaker_1"},"\n","^Oi…they better not be saying stuff about Val. ",{"#":"inner_monologue"},"\n","^A Chinese girl? Why would a Chinese girl date Ravi? Was she cute or not? ",{"#":"speaker_2"},"\n","^Wah Marcus you really get it man. That’s the spirit ",{"#":"speaker_1"},"\n","^Cutting straight to the heart of the matter! ",{"#":"speaker_1"},"\n","^7 / 10 ",{"#":"speaker_1"},"\n","^Maybe a bit higher, but under 8. ",{"#":"speaker_1"},"\n","^I mean let’s be real tbh ",{"#":"speaker_1"},"\n","^tbh?! wth ... ",{"#":"inner_monologue"},"\n","^Ravi got gf. I got you. 😅 What’s wrong with this world? ",{"#":"speaker_1"},"\n","^How come the ugly guys get the girls ah? ",{"#":"speaker_1"},"\n","^I can’t get any matches on my dating apps ",{"#":"speaker_1"},"\n","^Splinter, TehMeetDonut, Stumble all nothing ",{"#":"speaker_1"},"\n","^Then Ravi from nowhere also can get gf ",{"#":"speaker_1"},"\n","^How come our an neh (derogatory term for indian) don’t get some Rani or Vani ah? ",{"#":"speaker_1"},"\n","^Now less girls for me to pick man ",{"#":"speaker_1"},"\n","^What is an an neh? ",{"#":"speaker_2"},"\n","^You don’t know what an an neh is ah? ",{"#":"speaker_1"},"\n","^Ravi la, his type ",{"#":"speaker_1"},"\n","^Aiyah anyway life’s unfair I tell you ",{"#":"speaker_1"},"\n","^This kind still say I got Chinese privilege ",{"#":"speaker_1"},"\n","^If I really got Chinese privilege then where is my chiobu?  ",{"#":"speaker_1"},"\n","^Eh... this chat group is the main one. Oh crap.  ",{"#":"speaker_1"},"\n","^<This message has been deleted> ",{"#":"speaker_2"},"\n","^<This message has been deleted> ",{"#":"speaker_1"},"\n","^<This message has been deleted> ",{"#":"speaker_1"},"\n","^<This message has been deleted> ",{"#":"speaker_1"},"\n","^<This message has been deleted> ",{"#":"speaker_1"},"\n","^<This message has been deleted> ",{"#":"speaker_1"},"\n","^Wrong group sorry ",{"#":"speaker_1"},"\n","^<This message has been deleted> ",{"#":"speaker_2"},"\n","^<This message has been deleted> ",{"#":"speaker_2"},"\n","^<This message has been deleted> ",{"#":"speaker_2"},"\n","^<This message has been deleted> ",{"#":"speaker_2"},"\n","^They finally noticed. I knew they were mean, but not this horrible. I didn’t realise I was THAT invisible. They really ran their mouths huh? Said what they were thinking? ",{"#":"inner_monologue"},"\n","^I’m disappointed. No, I’m angry. NO – I’m ENRAGED. FURIOUS. If Valerie were in my shoes she’d find their addresses, go to their houses and punch them in the face. ",{"#":"inner_monologue"},"\n","^I can’t take this anymore. I don’t know how I’m supposed to look them in the eyes tomorrow. What should I do? ",{"#":"inner_monologue"},"\n","^. ",{"#":"clear"},"\n","ev","str","^Confront them","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Play dumb","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"ravi_3_4a"},"\n",{"#f":5}],"c-1":["^ ",{"->":"ravi_3_4b"},"\n",{"#f":5}]}],{"#f":1}],"ravi_3_4a":[{"#":"knot:ravi_3_4a"},{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Interns @ Turbine Engineering"},{"#":"chat_group_image:ico_ravi_turbine.png"},{"#":"speaker_1_name:Qi An"},{"#":"speaker_2_name:Marcus"},{"#":"speaker_3_name:Roger"},{"#":"timestamp:16.37"},"^Hey. I saw all that. ",{"#":"speaker_self"},"\n","^Oh no. This is a bad situation. ",{"#":"speaker_2"},"\n","^Hey bro, sorry ah haha ",{"#":"speaker_1"},"\n","^I was just joking ",{"#":"speaker_1"},"\n","^Don’t “bro” me. ",{"#":"speaker_self"},"\n","^I KNOW you weren’t joking ",{"#":"speaker_self"},"\n","^You really insulted both me and my girlfriend ",{"#":"speaker_self"},"\n","^You think it’s ok to make these jokes? ",{"#":"speaker_self"},"\n","^Grow up la ",{"#":"speaker_self"},"\n","^Hey man, I’m sorry. I really didn’t mean to offend you ",{"#":"speaker_1"},"\n","^What did you mean then? ",{"#":"speaker_self"},"\n","^I’ve been quiet this whole internship ",{"#":"speaker_self"},"\n","^Don’t think I didn’t hear what you tell Marcus all the time ",{"#":"speaker_self"},"\n","^I’m going to talk to somebody about this ",{"#":"speaker_self"},"\n","^I don’t care that you act like a bigshot just because you know the CEO or whatever ",{"#":"speaker_self"},"\n","^(roger is typing…) ",{"#":"timestamp"},"\n","^Hey boys. I’m in this chat too you know ",{"#":"speaker_3"},"\n","^Oh no. This bad situation just got worse. ",{"#":"speaker_2"},"\n","^I don’t know what you guys were talking about ",{"#":"speaker_3"},"\n","^And I can’t read the messages that were deleted ",{"#":"speaker_3"},"\n","^But take it offline. Don’t do this in our work group ",{"#":"speaker_3"},"\n","^Ravi, come see me in my office tomorrow. ",{"#":"speaker_3"},"\n","^What did I do wrong? What about Qi An? ",{"#":"speaker_self"},"\n","^I don’t know what Qi An wrote. he deleted it already but he apologised already ",{"#":"speaker_3"},"\n","^You need to learn to be more professional. ",{"#":"speaker_3"},"\n","^I hope this puts an end to this, whatever this was. Got it? ",{"#":"speaker_3"},"\n","^Affirmative. ",{"#":"speaker_2"},"\n","^...Alright. ",{"#":"speaker_self"},"\n","^This isn’t fair. I didn’t do anything wrong. ",{"#":"inner_monologue"},"\n","^Roger didn’t see what Qi An wrote. I’m sure I can tell him tomorrow. Roger’s a nice guy, he’ll listen to me. But I don’t have any proof. I didn’t take any screenshots. ",{"#":"inner_monologue"},"\n","^And even if Roger did understand, what can he do about it? It’s already over. The messages are gone already. ",{"#":"inner_monologue"},"\n","^This is getting out of hand. I can’t go on like this. I am asking to be transferred to another department starting tomorrow. Or better still, quit this internship. ",{"#":"inner_monologue"},"\n",{"->":"ravi_3_5"},{"#f":1}],"ravi_3_4b":[[{"#":"knot:ravi_3_4b"},{"#":"ui:whatsapp"},{"#":"background:whatsapp.png"},{"#":"chat_group_title:Interns @ Turbine Engineering"},{"#":"chat_group_image:ico_ravi_turbine.png"},{"#":"speaker_1_name:Qi An"},{"#":"speaker_2_name:Marcus"},{"#":"speaker_3_name:Roger"},{"#":"timestamp:16.37"},"^Hey guys. Any plans today? ",{"#":"speaker_self"},"\n","^Oh hey Ravi... No...just going to finish up and go for family dinner. ",{"#":"speaker_1"},"\n","^Negative. Still clearing my work. ",{"#":"speaker_2"},"\n","^Really? Because I could swear I saw like 300 messages here that just vanished all of a sudden. ",{"#":"speaker_self"},"\n","^I got a notification for each and every message you know ",{"#":"speaker_self"},"\n","^My phone was vibrating like crazy eh ",{"#":"speaker_self"},"\n","^Huh? What are you talking about ",{"#":"speaker_1"},"\n","^Must be a bug haha ",{"#":"speaker_1"},"\n","^Possibly. ",{"#":"speaker_2"},"\n","^A bug ah? Oh phew ",{"#":"speaker_self"},"\n","^I didn’t read the full thing but I saw something about my girlfriend ",{"#":"speaker_self"},"\n","^In case you guys don’t know I’m attached ",{"#":"speaker_self"},"\n","^Must be a weird bug, I think it showed me some message I sent her in this chat instead? Weird ",{"#":"speaker_self"},"\n","^Haha, yah, must be ",{"#":"speaker_1"},"\n","^Wah congrats bro I didn’t know you had a girlfriend ",{"#":"speaker_1"},"\n","^Can she speak tamil though ",{"#":"speaker_1"},"\n","^Why would you ask that? ",{"#":"speaker_self"},"\n","^Oh, uh...nvm ",{"#":"speaker_1"},"\n","^Yeah why did I ask that ",{"#":"speaker_1"},"\n","^Oh ok. Anyway I don’t want to waste your time. ",{"#":"speaker_self"},"\n","^Enjoy your family dinner, I’m heading home too. See you tomorrow! =) ",{"#":"speaker_self"},"\n","^This is getting out of hand. I can’t go on like this. I am asking to be transferred to another department starting tomorrow. Or better still, quit this internship. ",{"#":"inner_monologue"},"\n","ev","str","^End of Chapter 3","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Flow on to Chapter 4","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ","end","\n",{"#f":5}],"c-1":["^  ",{"->":"ravi_3_5"},"\n",{"#f":5}]}],{"#f":1}],"ravi_3_5":[[{"#":"knot:ravi_3_minigame"},{"#":"ui:mcq"},{"#":"game_id:8"},"^Minigame 9","\n",{"#":"knot:ravi_3_5"},{"#":"ui:notification"},{"#":"background:ui_ravi_phonecall.jpg"},"^VALERIE ",{"#":"message"},"\n",{"#":"ui:scene"},{"#":"background:bg_ravi_valnumber.jpg"},{"#":"speaker_left_image:cha_ravi_valerie_concerned.png"},{"#":"speaker_left_name:Val (phone)"},"^Hey ",{"#":"speaker_left"},"\n","^Hey Val. ",{"#":"speaker_self"},"\n","^How are you? ",{"#":"speaker_left"},"\n","^As good as can be. ",{"#":"speaker_self"},"\n","^It is hard, Ravi. I can see you struggling. ",{"#":"speaker_left"},"\n",["ev",{"^->":"ravi_3_5.0.30.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^I'll get by, somehow",{"->":"$r","var":true},null]}],["ev",{"^->":"ravi_3_5.0.31.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^I can see myself struggling. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ravi_3_5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.30.s"},[{"#n":"$r2"}],"^ ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["ev",{"^->":"ravi_3_5.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.31.s"},[{"#n":"$r2"}],"^ But I can’t seem to do anything about it. ",{"#":"speaker_self"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^I’m here for you. ",{"#":"speaker_left"},"\n","^I’m not here for me. I can’t even find myself, Val. There is a huge weight sitting on my neck. And I can’t seem to lift it. I’ve never felt this sick before. ",{"#":"speaker_self"},"\n","^I’m so sorry. I had no idea. ",{"#":"speaker_left"},"\n","^You know, when you think you saw something? But it isn’t actually there? ",{"#":"speaker_self"},"\n","^Hmm...yes? ",{"#":"speaker_left"},"\n","^That’s what every day feels like. Like it never happened. But it left a stain on me that I can’t seem to rub off. ",{"#":"speaker_self"},"\n","^That is heavy. ",{"#":"speaker_left"},"\n","^It is. I can’t seem to move myself anywhere. Work is going horrible. I don’t see my family any more. Even when I do, I don’t know what to tell them. I don’t have the heart to tell them.","\n","^I just eat. Sambar, fish curry. Then I make up some excuse and leave. I can’t sleep at night. I’m awake, looking at my phone, scrolling through an endless stream of tik toks.","\n","^I sleep when I start to see the sun, out of fear of not getting enough sleep, which I don’t anyway. I have to be up at 7am. I gag when I brush my teeth. Like I want to puke. But nothing comes out. ",{"#":"speaker_self"},"\n","^Ravi. I don’t know what to say..other than… ",{"#":"speaker_left"},"\n","^Other than what? ",{"#":"speaker_self"},"\n","^I’m so sorry. I feel like I added to all the pressure. ",{"#":"speaker_left"},"\n",["ev",{"^->":"ravi_3_5.0.g-0.37.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^No! Val! You’re my one bright spot.",{"->":"$r","var":true},null]}],["ev",{"^->":"ravi_3_5.0.g-0.38.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^Oh Val, I haven’t been very nice to you. ",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"ravi_3_5.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.37.s"},[{"#n":"$r2"}],"^ ",{"#":"speaker_self"},"\n","^If I’m the bright spot, then something isn’t right. ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["ev",{"^->":"ravi_3_5.0.g-0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.38.s"},[{"#n":"$r2"}],"^ ",{"#":"speaker_self"},"\n","^Tbh I was a bit confused. But I know that person at that stupid kopitiam isn’t you. I just didn’t know why. ",{"#":"speaker_left"},"\n","^It’s not me. Who was that guy? Let me beat him up. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^I’ve been a shitty boyfriend huh? ",{"#":"speaker_self"},"\n","^This isn’t about me. ",{"#":"speaker_left"},"\n","^I care about you a lot, you know. ",{"#":"speaker_self"},"\n","^I know. I wouldn’t be with you if you didn’t. ",{"#":"speaker_left"},"\n","^Thank you ",{"#":"speaker_self"},"\n","^“Thank you?” Am I one of your “colleagues” now? So formal. ",{"#":"speaker_left"},"\n","^Eh don’t liddat. I’m just trying to be polite. ",{"#":"speaker_self"},"\n","^Can I tell you something? ",{"#":"speaker_left"},"\n","^I know you will. ",{"#":"speaker_self"},"\n","^I feel like you’re trying to be so many things you’re forgetting to be yourself. ",{"#":"speaker_left"},"\n","^Am I? ",{"#":"speaker_self"},"\n","^Coffee shop Ravi and Kopitiam Ravi are so different. ",{"#":"speaker_left"},"\n","^Haha ",{"#":"speaker_self"},"\n","^Ooh hear that sound? ",{"#":"speaker_left"},"\n","^What sound? ",{"#":"speaker_self"},"\n","^Something strange. ",{"#":"speaker_left"},"\n","^Huh? ",{"#":"speaker_self"},"\n","^Sounded like a laugh. Your laugh. Haven’t heard that in a while. ",{"#":"speaker_left"},"\n",["ev",{"^->":"ravi_3_5.0.g-1.54.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":2},{"s":["^You’re so lame. ",{"->":"$r","var":true},null]}],["ev",{"^->":"ravi_3_5.0.g-1.55.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":2},{"s":["^You always know how to cheer me up ",{"->":"$r","var":true},null]}],{"c-4":["ev",{"^->":"ravi_3_5.0.g-1.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.54.s"},[{"#n":"$r2"}],"^ ",{"#":"speaker_self"},"\n","^You have no idea. ",{"#":"speaker_left"},"\n","^Actually, I do. Nobody else has a spotify list specifically for brushing teeth. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-5":["ev",{"^->":"ravi_3_5.0.g-1.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.55.s"},[{"#n":"$r2"}],"^ ",{"#":"speaker_self"},"\n","^I have a hundred more ideas to cheer you up, still unused! Like... ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Have you ever tried brushing your teeth to Megan Thee Stallion? ",{"#":"speaker_left"},"\n","^I can’t say I have. ",{"#":"speaker_self"},"\n","^You’ll feel shiny eeeeee! ",{"#":"speaker_left"},"\n","^Ok I’ll try tomorrow morning haha. ",{"#":"speaker_self"},"\n","^Promise you’ll do it? Or at least do something that’ll cheer you up? ",{"#":"speaker_left"},"\n","ev","str","^I will","/str","/ev",{"*":".^.c-6","flg":4},"ev","str","^It's hard","/str","/ev",{"*":".^.c-7","flg":4},{"c-6":["^ Yeah. Thank you Val. ",{"#":"speaker_self"},"\n","^Yay! That’s more like the Ravi I know and love. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_incredulous.png"},"^Wait..what? ",{"#":"speaker_self"},"\n","^Shit ",{"#":"speaker_left"},"\n","^Shit? ",{"#":"speaker_self"},"\n","^I mean. Not shit. I ... I do love you. ",{"#":"speaker_left"},"\n","^I know. It’s just weird to hear you say it. ",{"#":"speaker_self"},"\n","^Weird? ",{"#":"speaker_left"},"\n","^I mean...not weird. But you, know, strange. ",{"#":"speaker_self"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_flirt.png"},"^Ok. Keep analysing the philosophies of me kinda pouring my heart out and letting me know it is unfathomable to your imagination that I could possibly love you. ",{"#":"speaker_left"},"\n","^Um..sorry. I just didn’t expect it. ",{"#":"speaker_self"},"\n","^It’s cool. You’ve always been a bit of a space cadet. Head always up in the clouds, Mr. Aeronaut. ",{"#":"speaker_left"},"\n","^I think it goes without saying... ",{"#":"speaker_self"},"\n","^When things go without saying, they just go without saying. So, say it, if you mean it. ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-7":["^ It’s hard. I don’t think I can just magically switch into sunshine mode. ",{"#":"speaker_self"},"\n","^I don’t expect you to. It’ll be a while before you get back to the Ravi I know and love. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_incredulous.png"},"^Wait..what? ",{"#":"speaker_self"},"\n","^Shit ",{"#":"speaker_left"},"\n","^Shit? ",{"#":"speaker_self"},"\n","^I mean. Not shit. I.. I do love you. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_flirt.png"},"^I know. It’s just weird to hear you say it. ",{"#":"speaker_self"},"\n","^Weird? ",{"#":"speaker_left"},"\n","^I mean...not weird. But you, know, strange. ",{"#":"speaker_self"},"\n","^I know the feeling. It’s strange for me too. ",{"#":"speaker_left"},"\n","^Um..sorry. I just didn’t expect it. ",{"#":"speaker_self"},"\n","^Well, it doesn’t change the fact that I, at this moment, without a doubt, love you. ",{"#":"speaker_left"},"\n","^I think it goes without saying... ",{"#":"speaker_self"},"\n","^When things go without saying, they just go without saying. So, say it, if you mean it. ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^I love you. ",{"#":"speaker_self"},"\n","^Great. Now that that’s out of the way… ",{"#":"speaker_left"},"\n","^Ufff ",{"#":"speaker_self"},"\n","^What? ",{"#":"speaker_left"},"\n","^We are so cheesy ",{"#":"speaker_self"},"\n","^Extra cheese, baby. ",{"#":"speaker_left"},"\n",{"#":"speaker_left_image:cha_ravi_valerie_happy.png"},"^Feels good getting things off my chest. ",{"#":"speaker_self"},"\n","^Good. You dwell in your own thoughts like that, you’re gonna have to start paying rent. ",{"#":"speaker_left"},"\n","^I’m a lousy tenant. ",{"#":"speaker_self"},"\n","^But a great engineer. And an amazing barista. God, I sound like one of those manic pixie dream girls, whose entire character arc consists of trying to get the hero back to his hero-ness. ",{"#":"speaker_left"},"\n","^But gifted with a certain charming self-awareness which makes the protagonist’s progress all the more fulfilling. ",{"#":"speaker_self"},"\n","^Oi, what makes you think you’re the protagonist in this story? I cannot be protagonist, is it? ",{"#":"speaker_left"},"\n","^You’re the wing beneath my winds! ",{"#":"speaker_self"},"\n","^It’s the other way around lah bodoh. You’re good at many things, but singing isn’t one of them. Anyway, good night. I should really go to sleep. Got an early start tomorrow. ",{"#":"speaker_left"},"\n","^Want me to sing you a lullaby? ",{"#":"speaker_self"},"\n","^I’d rather kiss a jellyfish. ",{"#":"speaker_left"},"\n","^And tomorrow, what are you doing? Apart from jellyfish-kissing. ",{"#":"speaker_self"},"\n","^Going to a UX class. I told you. ",{"#":"speaker_left"},"\n","^Ah yes. ",{"#":"speaker_self"},"\n","^What are you up to? ",{"#":"speaker_left"},"\n","^Made no plans. Might sleep in. ",{"#":"speaker_self"},"\n","^Maybe go see your family. I think it’ll be nice. ",{"#":"speaker_left"},"\n",{"->":"ravi_3_6"},{"#f":5}]}],{"#f":1}],"ravi_3_6":[[{"#":"knot:ravi_3_6"},{"#":"ui:narrator"},{"#":"background:bg_ravi_bedroom.jpg"},"^Sunday, 4.15 pm.","\n","^I wonder how Amma is doing. And I miss Revu. I've been so busy, I haven't seen them in a while. I should probbaly go over to Aunty Pushpa's place to see them.","\n","^And maybe I should tell them about Val.","\n","^Or maybe now is not the right time. Hmm, maybe wait a bit, eh? But I want to tell them!","\n","^...But now is not the right time.","\n",{"#":"ui:scene"},{"#":"background:bg_ravi_pushpa_home.jpg"},{"#":"speaker_left_image:cha_ravi_mum_dress_normal.png"},{"#":"speaker_left_name:Amma"},{"#":"speaker_right_image:cha_ravi_revati_normal.png"},{"#":"speaker_right_name:Revati"},"^Hi Revu! ",{"#":"speaker_self"},"\n","^Oh, the prodigal son returns! Poor Amma isn’t here to welcome her darling son back. What a travesty. ",{"#":"speaker_left"},"\n","^So drama lah you! ",{"#":"speaker_self"},"\n","^Then what? You haven’t come home in, like, three weeks?? ",{"#":"speaker_left"},"\n","^Yeah, I know. Been busy. Where’s Amma? ",{"#":"speaker_self"},"\n","^What kind of excuse is that? Amma has just gone to the store I think. She is going to ask why you haven’t cut your hair when she comes back? ",{"#":"speaker_left"},"\n","^I like it with a little curry puff on top haha ",{"#":"speaker_self"},"\n","^Oh, we have some curry puff from the mamak shop next door. Want? ",{"#":"speaker_left"},"\n","ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^No","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^  Yes, I’m super hungry!  ",{"#":"speaker_self"},"\n","^Sardine or potato?  ",{"#":"speaker_left"},"\n","^Potato, you know me.  ",{"#":"speaker_self"},"\n","^Yeah, you’re a couch potato! ",{"#":"speaker_left"},"\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["^ No, maybe later.  ",{"#":"speaker_self"},"\n","^Creamy potato filling. Just the right blend of flavourful spices.  Buttery, flaky dough calling out for you to crunch it.    ",{"#":"speaker_left"},"\n","^Uff. I can’t say no.  ",{"#":"speaker_self"},"\n","^Good. There’s a paiseh piece left.  ",{"#":"speaker_left"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^mmmm sooo good mmmmfffnomnom ",{"#":"speaker_self"},"\n","^It’s good right? ",{"#":"speaker_left"},"\n","^Yeah I should take some for Val. She’ll love it. ",{"#":"speaker_self"},"\n","^Val? Who’s Val? ",{"#":"speaker_left"},"\n","^Oh shoot, what is wrong with me...damn you curry puff for distracting me! ",{"#":"inner_monologue"},"\n","ev","str","^A friend","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^A customer","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["^ Oh, just a friend. ",{"#":"speaker_self"},"\n","^“Just a friend?” Hmm... ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["^ Oh, just a regular customer. ",{"#":"speaker_self"},"\n","^“Just a regular customer?” Hmm... ",{"#":"speaker_left"},"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^Really! ",{"#":"speaker_self"},"\n","^Don’t pull this innocent act on me. I’ve known you since I was born. ",{"#":"speaker_left"},"\n","^Ugh. Ok. She’s my girlfriend. ",{"#":"speaker_self"},"\n","^Waaaaaah! You also can get girlfriend ah? ",{"#":"speaker_left"},"\n","^Why does everyone keep saying that? ",{"#":"speaker_self"},"\n","^Eh, who else is saying that? Only I’m allowed to make fun of you. ",{"#":"speaker_left"},"\n","^Guys at work. Anyway... ",{"#":"speaker_self"},"\n","^Huh, guys at work? And what’s her name?? ",{"#":"speaker_left"},"\n","^Valerie. ",{"#":"speaker_self"},"\n","^Eeee so exciting! ",{"#":"speaker_left"},"\n","^Haha... ",{"#":"speaker_self"},"\n","^Show me a picture! ",{"#":"speaker_left"},"\n","^...I don’t have any. ",{"#":"speaker_self"},"\n","^Useless. Show me her IG la! ",{"#":"speaker_left"},"\n","^Oh yeah. Here you go. ",{"#":"speaker_self"},"\n","^Dude, she’s hot. ",{"#":"speaker_left"},"\n","^Yeah, dude. Thanks, I guess? ",{"#":"speaker_self"},"\n","^How did you get with her? ",{"#":"speaker_left"},"\n","^Through my charm, good looks, and oozing machismo. ",{"#":"speaker_self"},"\n","^Machismo your head lah. The only thing you’re oozing are bad jokes. She probably took pity on your terrible hairstyle and thought you needed help. ",{"#":"speaker_left"},"\n","^Something like that. ",{"#":""},"\n","^So...are you going to tell mum? ",{"#":"speaker_left"},"\n","ev","str","^Yes","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Hmmm, maybe not","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["^ Yeah, think I should tell her. ",{"#":"speaker_self"},"\n","^You should! ",{"#":"speaker_left"},"\n","^Really? ",{"#":"speaker_self"},"\n","^Yeah. Are you scared? ",{"#":"speaker_left"},"\n","^Yeah. I don’t know what she’ll say. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-5":["^ Hmmm... I'm scared, Revu. ",{"#":"speaker_self"},"\n","^Of what?! ",{"#":"speaker_left"},"\n","^Of what she might say. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^You’re so annoying. Mum will be super happy! Just the other day, she was asking me if I knew if you were dating someone. ",{"#":"speaker_left"},"\n","^What?? ",{"#":"speaker_self"},"\n","^Yeah. We talk a loooot about you. ",{"#":"speaker_left"},"\n","^I’m just scared of, you know, what she’ll say about me dating a Chinese girl. ",{"#":"speaker_self"},"\n","^Do you like her? Is she cool? ",{"#":"speaker_left"},"\n","^Yeah ",{"#":"speaker_self"},"\n","^Then she’s cool with me. And she’s cool with Amma. ",{"#":"speaker_left"},"\n","^I don’t know man. There was a whole thing at work. ",{"#":"speaker_self"},"\n","^Ok. And that’s supposed to matter because? ",{"#":"speaker_left"},"\n","^These guys had a whole whatsapp chat about me and Val. It was embarrassing. ",{"#":"speaker_self"},"\n","^Well, I am not your colleague. And Amma is not your colleague. And if people at work are acting like it’s the middle ages, then it’s time you spoke to them about it. Coz, that’s not cool. ",{"#":"speaker_left"},"\n","^I will. ",{"#":"speaker_self"},"\n","^Oh wait, Amma is here. AMMA, RAVI HAS A GIRLFRIEND! ",{"#":"speaker_left"},"\n","^Shut up!!! ",{"#":"speaker_self"},"\n","^Who has a girlfriend? ",{"#":"speaker_right"},"\n","^Hello Amma. How was your day? I think there are some curry puffs I think. Oh no wait, I finished all of them haha. Where were you Amma? How was your day? ",{"#":"speaker_self"},"\n","^Oh god, stupid revuuuu! I’m blabbering! ",{"#":"inner_monologue"},"\n","^Oh hello kanna! I’ve never seen you this excited. You’ve lost weight. As usual. ",{"#":"speaker_right"},"\n","^Oh do we have to be a cliche? I’ve become fitter. Look at my muscles. ",{"#":"speaker_self"},"\n","^You call them muscles? More like mussels. ",{"#":"speaker_left"},"\n","^What? ",{"#":"speaker_self"},"\n","^Mussels, like the little snotty things inside a shell. Like you. ",{"#":"speaker_left"},"\n","^You think you so funny is it! ",{"#":"speaker_self"},"\n","^Funnier than you lah! ",{"#":"speaker_left"},"\n","^Not funnier than that little moustache on your lip twitch-twitch-twitch blowing in the wind. ",{"#":"speaker_self"},"\n","^Amma! ",{"#":"speaker_left"},"\n","^Ravi, stop bullying your sis. What’s this about a girlfriend? ",{"#":"speaker_right"},"\n","^Ho ho ho! ",{"#":"speaker_left"},"\n","^Uh..nothing ma. She’s just blabbering. ",{"#":"speaker_self"},"\n","^நேதஂதிகஂகு தானஂ எனஂ காது குத்திசஂசா? (Do you think my ears were pierced yesterday?)? Who is this girl? ",{"#":"speaker_right"},"\n","^Uh..just a friend ma. ",{"#":"speaker_self"},"\n","^Just a friend. And a girl... ",{"#":"speaker_left"},"\n","^Why are you acting like a kid? ",{"#":"speaker_self"},"\n","^Leave her alone. Who’s this girl? ",{"#":"speaker_right"},"\n","^Valerie...she’s really cool. She loves Indian food and... ",{"#":"speaker_self"},"\n","^...Indian guys... ",{"#":"speaker_left"},"\n","^Revati, can you shut up for a second please? ",{"#":"speaker_self"},"\n","^Ravi, stop yelling at her! ",{"#":"speaker_right"},"\n","^She’s being so annoying ma! ",{"#":"speaker_self"},"\n","^Yeah I know. Doesn’t mean you can yell at her like that. ",{"#":"speaker_right"},"\n","^Sorry.. ",{"#":"speaker_self"},"\n","^Anyway, tell me. Valerie ah? ",{"#":"speaker_right"},"\n","^Yeah amma. Just met her a couple of months ago. ",{"#":"speaker_self"},"\n","^Very cute too! ",{"#":"speaker_left"},"\n","^Is she? ",{"#":"speaker_right"},"\n","^Yeah. She looks like some indie movie actress haha ",{"#":"speaker_left"},"\n","^Oh god my sis will be the death of me. ",{"#":"inner_monologue"},"\n","^Like which Hindi movie actress? ",{"#":"speaker_right"},"\n","^No! Indie! Like independent movies. You know, super cool, super cute, super quirky. ",{"#":"speaker_left"},"\n","^She is also super friendly ma. You’ll like her. ",{"#":"speaker_self"},"\n","^Yeah that’s what I said! ",{"#":"speaker_left"},"\n","^Ok. Busy with girlfriend ah? Is that why you haven’t come over in so long? ",{"#":"speaker_right"},"\n","^It’s not like that ma. ",{"#":"speaker_self"},"\n","^Then what? Didn’t come for dinner here. No call also? ",{"#":"speaker_right"},"\n","^Just super busy with work ma. ",{"#":"speaker_self"},"\n","^Doesn’t matter. You make sure you come see us ok? Girlfriend or no girlfriend. Busy or not busy. ",{"#":"speaker_right"},"\n","^It’s just that...it’s not been easy ma. ",{"#":"speaker_self"},"\n","^Why kanna? ",{"#":"speaker_right"},"\n","^Work has been hard. And I’ve been working at the cafe too. And I have...a girlfriend now… ",{"#":"speaker_self"},"\n","^Don’t think you can talk to me, is it? ",{"#":"speaker_right"},"\n","^That’s not what I meant, ma. I did feel like I could talk to you. But I don’t want to make it hard for you with my problems also, you know? ",{"#":"speaker_self"},"\n","^Kanna, your problems are my problems. If you don’t tell me, we can’t solve it. Come sit down. ",{"#":"speaker_right"},"\n","^It’s ok ma. Can we just watch a movie or something? We can talk about this another time? ",{"#":"speaker_self"},"\n","^No. I’m going to make coffee. Think about what you want to talk about. ",{"#":"speaker_right"},"\n","^Oh where do I even begin. Val is Chinese. My colleagues are stupid. And I really have lost weight. ",{"#":"inner_monologue"},"\n","^So tell me about Valerie ",{"#":"speaker_right"},"\n","^She’s quite tall I think. Almost as tall as Ravi! ",{"#":"speaker_left"},"\n","^Revu, be quiet. Ravi, tell me. ",{"#":"speaker_right"},"\n",["ev",{"^->":"ravi_3_6.0.g-2.204.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-6","flg":2},{"s":["^She’s a regular at the coffee shop ",{"->":"$r","var":true},null]}],["ev",{"^->":"ravi_3_6.0.g-2.205.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^,","/str","/ev",{"*":".^.^.c-7","flg":6},{"s":["^She's tall",{"->":"$r","var":true},null]}],{"c-6":["ev",{"^->":"ravi_3_6.0.g-2.c-6.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.204.s"},[{"#n":"$r2"}],"^ ",{"#":"speaker_self"},"\n","^Bet you made a heart shape on her coffee ",{"#":"speaker_left"},"\n","^Please lah. I’m not that lame. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-7":["ev",{"^->":"ravi_3_6.0.g-2.c-7.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.205.s"},[{"#n":"$r2"}],"^ She’s also very kind. And clever. ",{"#":"speaker_self"},"\n","^Kind and clever. All the things you’re not. Great. ",{"#":"speaker_left"},"\n","^Please lah. I’m clever ok? And very kind to you, you brat.  ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^She’s Chinese, is it? ",{"#":"speaker_right"},"\n","^Yeah  ",{"#":"speaker_self"},"\n","^Hmmm ",{"#":"speaker_right"},"\n","^Oh no. This is going to be a problem huh? I thought we could skirt over this topic. But cannot lah. ",{"#":"inner_monologue"},"\n","^I knew it. ",{"#":"speaker_right"},"\n","^Huh, how did you know? ",{"#":"speaker_self"},"\n","^You always had a thing for Chinese girls. That girl, Marie? ",{"#":"speaker_right"},"\n","^Eee no! Marie is like my sister. ",{"#":"speaker_self"},"\n","^Oh, good to know there’s one more to suffer with me. ",{"#":"speaker_left"},"\n","^Hmm, I thought there was something going on between you two. ",{"#":"speaker_right"},"\n","^Nothing ma. She’s my boss now anyway. Best boss ever! ",{"#":"speaker_self"},"\n","^Cannot find a good Indian girl? ",{"#":"speaker_right"},"\n","^I knew it. This question. It was always going to be like this. What can I say without offending her? ",{"#":"inner_monologue"},"\n","ev","str","^I tried","/str","/ev",{"*":".^.c-8","flg":4},"ev","str","^I never looked ","/str","/ev",{"*":".^.c-9","flg":4},{"c-8":["^ The one Indian girl I asked out said no. ",{"#":"speaker_self"},"\n","^Oh, that’s news! ",{"#":"speaker_right"},"\n","^Yeah, when I was, like 14. She said I was too dark. I cried the whole night. ",{"#":"speaker_self"},"\n","^Oh, I remember that day. Your eyes were swollen. You told me it was because Liverpool lost! ",{"#":"speaker_right"},"\n","^Yeah, that was the friend. Chandni. Stupid girl. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-4"},{"#f":5}],"c-9":["^ I really wasn’t looking for an Indian girl. ",{"#":"speaker_self"},"\n","^Why? Not good enough for you? ",{"#":"speaker_right"},"\n","^No! I really wasn’t looking for any girl! ",{"#":"speaker_self"},"\n","^Yeah, you think I was born yesterday? ",{"#":"speaker_right"},"\n","^Amma! Really! ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^Anyway. You know why I’m asking you, right? ",{"#":"speaker_right"},"\n","^Oh god, here it comes. Mum is going to say no. How can I break it to Val that my family is...racist? ",{"#":"inner_monologue"},"\n","^Because you want me to end up with an Indian girl? ",{"#":"speaker_self"},"\n","^No! Because I know it’s not easy. ",{"#":"speaker_right"},"\n","^Not easy? ",{"#":"speaker_self"},"\n","^Because it’s not common. And some people have a problem with it. ",{"#":"speaker_right"},"\n","^I know! These guys at work. They were making fun of me. And her. And I kinda don’t want to work there any more. ",{"#":"speaker_self"},"\n","^At your internship? ",{"#":"speaker_right"},"\n","^Yeah. They said some pretty nasty things. Like how can someone like me get a girlfriend. And a chinese girlfriend.. ",{"#":"speaker_self"},"\n","^And what did you say? ",{"#":"speaker_right"},"\n","^What can I say? The boss also doesn’t think anything is wrong. I don’t know what to do. Because if I yell at them, I’m the bad guy. If I don’t, then I’m the weakling. ",{"#":"speaker_self"},"\n","^And Valerie? What does she say? ",{"#":"speaker_right"},"\n","^She says she likes me a lot..and wants to be with me. ",{"#":"speaker_self"},"\n","^Ok. Then what’s the problem? ",{"#":"speaker_right"},"\n","^Problem is...I don’t know if I can be with her like this. Like, people passing comments. ",{"#":"speaker_self"},"\n","^Ravi, this is not you. You date a Chinese girl, or Indian girl, or Indonesian girl...I don’t care. ",{"#":"speaker_right"},"\n","^Really? ",{"#":"speaker_self"},"\n","^Yes! Did you really think I would have a problem with you dating someone? You think I’m one of your colleagues? ",{"#":"speaker_right"},"\n","^You tell him! I told him the same thing! ",{"#":"speaker_left"},"\n","^Look, kanna. We are all going through a very tough time. I don’t need to tell you this. We have to tackle things together. ",{"#":"speaker_right"},"\n","^I know..but I thought… ",{"#":"speaker_self"},"\n","^Don’t keep thinking...talk to me! ",{"#":"speaker_right"},"\n","^Sorry, I just thought I would have to deal with some things myself. I don’t want to burden you. ",{"#":"speaker_self"},"\n","^Yes, there are some things you have to deal with yourself. But don’t think you have to save the family on your own. Burden, it seems. I have been working for 30 over years. I know it’s hard. ",{"#":"speaker_right"},"\n","^Look, it’s ok to date who you like. It’s ok to expect to be respected at work. ",{"#":"speaker_right"},"\n","^Amma, so it’s ok? ",{"#":"speaker_self"},"\n","^Ok for what? ",{"#":"speaker_right"},"\n","^For me to date Valerie? ",{"#":"speaker_self"},"\n","^Revati, can you beat up your brother for me please? ",{"#":"speaker_right"},"\n","^With pleasure! ",{"#":"speaker_left"},"\n","^Ravi, have you not been listening to me? ",{"#":"speaker_right"},"\n","^I’m listening, ma. ",{"#":"speaker_self"},"\n","^There will be many obstacles. People won’t like the way you look. Or the way you speak. Or think you smell. There are very nice people. And not so nice people. You can’t control that. If you want to live away from us, that’s ok. But you can’t lose your way like this. And think we won’t support you. ",{"#":"speaker_right"},"\n","^And these once-in-a-blue-moon visits won’t do. ",{"#":"speaker_left"},"\n","^Aiyoh sorry lah. ",{"#":"speaker_self"},"\n","^It’s ok. You’ve always been the slow one in the family. I’m sure Valerie thinks so too. ",{"#":"speaker_left"},"\n","^She actually does. ",{"#":"speaker_self"},"\n","^Bring her home one day. Anyway, this internship. It is more important now. ",{"#":"speaker_right"},"\n","^Yes, it is. ",{"#":"speaker_self"},"\n","^So, have you decided? ",{"#":"speaker_right"},"\n","^About? ",{"#":"speaker_self"},"\n","^About what to do about your situation. ",{"#":"speaker_right"},"\n","^I don’t know. There is too much to think about. ",{"#":"speaker_self"},"\n","^When you look at everything together, it can be overwhelming. ",{"#":"speaker_right"},"\n","^Yeah, But I don’t even know where to start. It’s very complicated you know...I wish Appa was here... ",{"#":""},"\n","^Why? ",{"#":"speaker_right"},"\n","^He’s the reason I wanted to get into aeronautics in the first place. ",{"#":"speaker_self"},"\n","^He’s also the reason I had to take care of you all, by myself. ",{"#":"speaker_right"},"\n","^That’s why ma, I wish he was here. ",{"#":"speaker_self"},"\n","^How can you say that, Ravi? ",{"#":"speaker_left"},"\n","^It’s ok. Let him talk. ",{"#":"speaker_right"},"\n","^It’s not like that, ma. Can’t I wish for something? ",{"#":"speaker_self"},"\n","^Why don’t you wish for some gold and a condo while you’re at it. And oh, curry puff over right? You can also wish for some free curry puffs? ",{"#":"speaker_right"},"\n","^Amma, why are you getting angry? ",{"#":"speaker_self"},"\n","^I’m not. Go on, keep wishing, Ravi. ",{"#":"speaker_right"},"\n","^Amma, calm down. Ravi, you’re a real idiot. ",{"#":"speaker_left"},"\n","^I don’t know what I said that is so wrong ",{"#":"speaker_self"},"\n","^Why don’t you wish for some buddhi (brain)? ",{"#":"speaker_right"},"\n","^Amma, why are you getting so upset? ",{"#":"speaker_self"},"\n","^Yeah, I am sorry. I am only here to make you some fish curry and approve your girlfriends right? ",{"#":"speaker_right"},"\n","^Why is Amma so angry? I can’t miss my pa? Maybe I shouldn’t have said what I said. But she literally just said I am supposed to speak my mind. And here I thought we were having a moment. ",{"#":"inner_monologue"},"\n","ev","str","^Stay calm","/str","/ev",{"*":".^.c-10","flg":4},"ev","str","^Fire back","/str","/ev",{"*":".^.c-11","flg":4},{"c-10":["^ That’s not what I said, ma. ",{"#":"speaker_self"},"\n","^You don’t need to say any more. ",{"#":"speaker_right"},"\n","^You want me to speak my mind, and then you get angry when I do. ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-5"},{"#f":5}],"c-11":["^ This is why I don’t come to the house.  ",{"#":"speaker_self"},"\n","^Oh, big man. ",{"#":"speaker_right"},"\n","^You want me to speak my mind, and then you get angry when I do.   ",{"#":"speaker_self"},"\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["^I said, speak your mind. I also told you not to bring up appa. ",{"#":"speaker_right"},"\n","^Whatever. If he was here, we wouldn’t be fighting like this. ",{"#":"speaker_self"},"\n","^Po Da (Go away)! You like flying planes right? Fly away like your appa. ",{"#":"speaker_right"},"\n","^Enough! Both of you! Stop fighting! ",{"#":"speaker_left"},"\n","^Sorry kanna. I didn’t mean to raise my voice. ",{"#":"speaker_right"},"\n","^It’s ok ma. I know why you’re angry. Ravi, can you, for a second, think about what you’re saying. Your words affect people you know. ",{"#":"speaker_left"},"\n","^Works both ways. ",{"#":"speaker_self"},"\n","^I’m tired of both of you talking to each other like this. Ravi, whatever you’re going through, we’ll be there. But you got to look at what’s here and now right? ",{"#":"speaker_left"},"\n","^YOU have to be there for me? I don’t want that. I want to be there for you. ",{"#":"speaker_self"},"\n","^Why is that? ",{"#":"speaker_left"},"\n","^Because I’m your brother. ",{"#":"speaker_self"},"\n","^Works both ways. ",{"#":"speaker_left"},"\n","^I know, but I’m the man here. ",{"#":"speaker_self"},"\n","^So? ",{"#":"speaker_left"},"\n","^So I have a responsibility. ",{"#":"speaker_self"},"\n","^Why, are we not capable of taking care of each other? You think because I’m a girl that I need big brother to support me? ",{"#":"speaker_left"},"\n","^Or Amma who wiped your ass when you were a kid needs saving? And only from you? Or our father, who even after all your wishing, is missing? ",{"#":"speaker_left"},"\n","^But you’re so little. And Amma is doing everything on her own. ",{"#":"speaker_self"},"\n","^And we should stick together. ",{"#":"speaker_left"},"\n","^I know. But who can I talk to about work ma? ",{"#":"speaker_self"},"\n","^Are you forgetting I have been working for so many years. Nothing you can learn from me, is it? ",{"#":"speaker_right"},"\n","^But you worked at a department store ma. It’s not the same. ",{"#":"speaker_self"},"\n","^Ravi! ",{"#":"speaker_left"},"\n","^He’s right. It’s not the same. But I can tell you this much. Not one of the days I have worked I have expected anything less than respect from anyone. And that respect, I give back to them. Whether you’re flying planes, or selling shoes you need to be happy with yourself. ",{"#":"speaker_right"},"\n","^If you are doing something for the sake of it, or just because Appa did it, then you will always feel small. The department store paid for your food. It paid for your clothes. It paid for your school. And your university. And even when they asked me to go, I had to respect that. ",{"#":"speaker_right"},"\n","^What is wrong with me? Can’t believe I am speaking to mum like that. ",{"#":"inner_monologue"},"\n","^I’m sorry. ",{"#":"speaker_self"},"\n","^You don’t have to be sorry. ",{"#":"speaker_right"},"\n","^Still, I’m sorry. I don’t know why I said all those things. My head is constantly full of doubt, and I feel like my dream will just stay that, you know, a dream. ",{"#":"speaker_self"},"\n","^You can realise your dream. But first, realise why the dream is important for you. Don’t anyhow think it’s for us, or for appa. Is it really what you want to do? ",{"#":"speaker_right"},"\n","^Yes. It still is. ",{"#":"speaker_self"},"\n","^Then you have a few decisions to make. Starting with speaking to your boss and your colleagues. Last time whenever I had a problem I brought it up. So many managers over my time. Some good lah. Some were so rude. Whether they help or not is out of your hands. But if you don’t speak up, then no chance. ",{"#":"speaker_right"},"\n","^Yeah ",{"#":"speaker_self"},"\n","^Do you want to stay in this internship? ",{"#":"speaker_right"},"\n","ev","str","^Stay?","/str","/ev",{"*":".^.c-12","flg":4},"ev","str","^Quit?","/str","/ev",{"*":".^.c-13","flg":4},{"c-12":["^ I think I want to stay. I can sort it out. Thank you ma. ",{"#":"speaker_self"},"\n","^Ok. Then you know what you have to do. ",{"#":"speaker_right"},"\n","^Yeah. I’m gonna speak to them next week. ",{"#":"speaker_self"},"\n","^Whatever they say, stay calm. Don’t get angry.Remember,ஆறுவது சினம் (Anger should be calmed) Then you lose your ground. ",{"#":"speaker_right"},"\n","^I will try ma. Thank you. ",{"#":"speaker_self"},"\n","^You decide what’s best for you. Be Ravi. Not a scaredy-poke. ",{"#":"speaker_right"},"\n",{"->":".^.^.^.g-6"},{"#f":5}],"c-13":["^ I think I want to quit ma. I don’t want to stay in a place like that. ",{"#":"speaker_self"},"\n","^Ok. Then can you do another internship? ",{"#":"speaker_right"},"\n","^I would have to look for one. ",{"#":"speaker_self"},"\n","^Would it be a problem? ",{"#":"speaker_right"},"\n","^Think it will be a bit hard because it’s a bit hard to get an internship outside the window. But I will try. ",{"#":"speaker_self"},"\n","^You decide what’s best for you. Be Ravi. Not a scaredy-poke. ",{"#":"speaker_right"},"\n",{"->":".^.^.^.g-6"},{"#f":5}],"#f":5}],"g-6":["^Amma didn’t raise a scaredy-poke. ",{"#":"speaker_left"},"\n","^No she didn’t. ",{"#":"speaker_self"},"\n","^Oh no she didn’t. ",{"#":"speaker_right"},"\n","^FINAL EMAIL SEQUENCE GOES HERE","\n",{"->":"ravi_3_reflection"},{"#f":5}]}],{"#f":1}],"ravi_3_reflection":[{"#":"knot:ravi_3_reflection"},{"#":"ui:chapter_reflection"},{"#":"reflection_id:9"},"^Reflection 9","\n","end",{"#f":1}],"global decl":["ev",3,{"VAR=":"character_id"},1,{"VAR=":"chapter_id"},0,{"VAR=":"ravi_1_motherempathy"},0,{"VAR=":"ravi_1_sharefrustrations"},"str","^polite","/str",{"VAR=":"ravi_1_agent"},1,{"VAR=":"ravi_1_notlikeotherindians"},1,{"VAR=":"ravi_1_emailuniversity"},1,{"VAR=":"ravi_1_dormhousing"},1,{"VAR=":"chapter_1_ending"},1,{"VAR=":"ravi_2_modernart"},1,{"VAR=":"chapter_2_ending"},"/ev","end",null],"#f":1}],"listDefs":{}}